[
    {
        "contents": "<div><p><span>Headway is building a new mental healthcare system that everyone can access. We make it easy for people to find quality in-network mental health care by removing historic barriers faced by mental health providers, payers, and patients. </span></p>\n<p><span>1 in 4 people in the US have a treatable mental health condition, but the vast majority do not get the care they need. The primary reason is cost: the majority of therapists do not accept insurance, meaning paying for therapy is prohibitively expensive. This is where we got our start – Headway has built the first software-enabled national network of therapists who accept health insurance, making it possible for patients to find quality care they can afford and enabling mental healthcare providers to grow their practice.</span></p>\n<p><span>We launched in April of 2019 and are now powering 500,000+ appointments a month. To scale our vision, we’ve raised over $225+ million in funding from a16z, Thrive, Accel, Spark Capital, Google Ventures, Andreessen Horowitz and Health Care Services Corporation.</span></p>\n<p><strong>Join us, and make an impact</strong></p></div>\n\n<p><strong>Are you a psychiatric mental health nurse practitioner (PMHNP-BC) in New Jersey looking to launch a private practice, or grow your existing practice?</strong></p>\n\n<p>Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing private practice.</p>\n\n<p>Psychiatric care practitioners use Headway in a number of ways, ranging from conducting psychotherapy sessions with patients to providing and overseeing medication management. Whether you're new to private practice or already have an established practice of your own, we’re excited to support you in reaching your goals!</p>\n\n<p><strong>By joining the Headway community, we’ll help you:</strong></p>\n\n<ul>\n<li>Accept insurance hassle-free by credentialing you with the nation’s largest networks and handling the billing and admin paperwork for you.</li>\n<li>Maintain a flexible schedule by deciding how many clients you see through Headway, so that you can set the hours that work for you.</li>\n<li>Grow your caseload by providing marketing support and patient referrals.</li>\n</ul>\n\n<p><strong>We’ll also support your patients by:</strong></p>\n\n<ul>\n<li>Providing customized support to clinicians and patients in order to streamline the process of both seeking and providing care.</li>\n<li>Verifying client insurance benefits instantly and automatically, so that access to care is never delayed, and you can see your patients with confidence.</li>\n</ul>\n\n<p>And we do this all <strong>without additional fees</strong>! Headways is a flexible service, meaning your hours are yours to set, and it’s up to you whether you see your patients in-person or remotely via telehealth while working from home.</p>\n\n<p><strong>Ready to get started?</strong></p>\n\n<p><strong>To join Headway’s growing community, you have:</strong></p>\n\n<ul>\n<li><strong>Licensure:</strong> You’re a fully licensed, ANCC board-certified psychiatric mental health nurse practitioner (PMHNP-BC) in New Jersey</li>\n<li><strong>NPI Number and Malpractice Insurance:</strong> We can point you in the right direction if you don’t have those yet!</li>\n<li><strong>DEA: </strong>You have a DEA number, or you’re open to acquiring one.</li>\n<li><strong>Collaborative Agreement: </strong>You have a valid collaborative agreement with a supervising physician, or you’re open to acquiring one.</li>\n</ul>\n\n<div><p><span>We believe a team's strength is in its people, and we cannot achieve this mission without a team that reflects the diversity of this problem - across race, ethnicity, gender, sexuality, age, national origin, religion, family status, disability, military status, and experience.</span></p>\n<p><span>Headway is committed to the full inclusion of all qualified individuals. As part of this commitment, Headway will ensure that persons with disabilities are provided with reasonable accommodations. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or receive other benefits and privileges of employment, please contact <a href=\"mailto:talent@findheadway.com\">talent@findheadway.com</a></span></p>\n<p><span>Headway employees work remotely across the US, with the option to work from offices in New York City and (coming soon!) San Francisco. </span><span>Headway participates in E-Verify. To learn more, click <a href=\"https://www.e-verify.gov/sites/default/files/everify/posters/EVerifyParticipationPoster.pdf\">here.</a><br></span></p></div>",
        "name": "Remote Psychiatric Mental Health Nurse Practitioner - New Jersey",
        "type": "external",
        "publication_date": "2023-10-20T23:08:10Z",
        "short_name": "remote-psychiatric-mental-health-nurse-practitioner-new-jersey",
        "model_type": "jobs",
        "id": 7153663,
        "locations": [
            {
                "name": "Flexible / Remote"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Mid Level",
                "short_name": "mid"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/headway/remote-psychiatric-mental-health-nurse-practitioner-new-jersey"
        },
        "company": {
            "id": 12029,
            "short_name": "headway",
            "name": "Headway"
        }
    },
    {
        "contents": "<p><b>Summary</b><br><br>The U.S. Department of State is developing a rank-ordered list of eligible hires for a limited number of Foreign Service Medical Provider (MP) (Family Nurse Practitioners and Physician Assistants) positions. A Recruitment Incentive of 10 percent of annual salary is available. Learn more about Foreign Service medical careers at <a href=\"https://careers.state.gov/med\">https://careers.state.gov/med</a>.<br> <br><a href=\"https://careers.state.gov/work/benefits/\">Joining the Foreign Service is more than just salary</a>. Refer to the Benefits section for more information.<br><br> <b>Duties</b><br><br>The Bureau of Medical Services (MED) maintains and promotes the health of employees and their eligible family members who represent U.S. government agencies abroad. The Department assigns Medical Providers (MPs) to posts overseas. Many of these posts have significant health risks and local medical care that is inadequate by U.S. standards.<br> <br>A Medical Provider works either independently or as a member of a team of Medical Specialists to provide medical support. A Medical Provider is considered \"essential personnel\" and is expected to be available on-call 24 hours a day, seven days a week. MPs duties may include, but are not limited to:<br><br><strong>Providing Primary Health Care Services</strong><ul> <li>All Medical Specialists working with the Bureau of Medical Services must be willing to provide primary care services and counseling to all patients regardless of age, sexual orientation, gender, race, ethnicity, national origin, language, disease, disability, or religion.</li> <li>Collects medical information from patients.</li> <li>Performs adult and pediatric medical examinations.</li> <li>Provides prenatal care.</li> <li>Performs medical clearance examinations.</li> <li>Orders and analyzes diagnostic tests.</li> <li>Prescribes treatment.</li> <li>Writes prescriptions.</li> <li>Performs therapeutic procedures.</li> <li>Documents patient information and keeps medical records.</li> <li>Uses other computer software to provide services.</li> <li>Consults with healthcare team.</li> <li>Advises patients on all medical concerns and acts as patient advocate when needed.</li> <li>Helps employees with adjustment to lifestyle and culture.</li> <li>Offers mental health support in conjunction with the Regional Psychiatrist.</li> <li>Provides routine and travel vaccinations and manages immunization program.</li> <li>Provides emergency care for those on U.S. government property.</li> <li>Evaluates local medical resources.</li> <li>Coordinates local medical care.</li> <li>Establishes professional networks of local healthcare providers.</li> <li>Maintains own credentials, licensure, and continuing medical education.</li> </ul><strong>Managing Occupational Health and Preventive Medicine Programs</strong><ul> <li>Identifies endemic conditions.</li> <li>Provides disease prevention programming and guidance.</li> <li>Performs health maintenance.</li> <li>Establishes wellness programs.</li> <li>Acts as the occupational health advisor in conjunction with Post's Occupational Safety and Health Officer.</li> <li>Maintains basic life support certification and conducts training.</li> <li>Ensures safe drinking water and monitors food safety in consultation with Laboratory Specialists.</li> <li>Oversees the pre-employment or fitness for duty of local employees.</li> <li>Orients new personnel.</li> <li>Updates post medical information.</li> <li>Adheres to quality assurance procedures.</li> <li>Submits reports.</li> </ul><strong>Administering Health Unit Functions</strong><ul> <li>Manages health unit resources.</li> <li>Hires, manages, and supervises local employees.</li> <li>Communicates regularly with Embassy/Consulate community and its leadership.</li> <li>Develops training programs for health unit staff and other Embassy/Consulate staff members as required.</li> <li>Exercises fiscal responsibility.</li> <li>Follows laboratory protocols. </li> <li>Participates in post's family advocacy program.</li> <li>Facilitates military access to care.</li> <li>Advises consular personnel.</li> </ul><strong>Coordinating Emergency Medical Response</strong><ul> <li>Provides emergency medical care.</li> <li>Provides medical leadership in crises.</li> <li>Advises post leadership.</li> <li>Initiates medical evacuations.</li> <li>Updates the emergency action plan.</li> <li>Manages the medical unit's emergency response programs.</li> <li>Provides emergency medical training.</li> <li>Coordinates post's epidemic medical response.</li> </ul><strong>Embassy or State Department Specific Responsibilities</strong><ul> <li>Arranges medical evacuations and oversees care for patients awaiting evacuation.</li> <li>Liaises with other regional medical officers and with local and international experts to support patient care.</li> <li>May assist with regional travel to support other Consulates/Embassies.</li> <li>Advises ambassador on medical matters.</li> <li>Supports all Embassy/Consulate occupational safety efforts including supporting the Post Safety and Health Officer (POSHO) in the Facilities office with regard to reporting of adverse occurrences.</li> <li>Communicates with medical headquarters in Washington.</li> <li>Participates in medical clearance decisions.</li> <li>Interfaces with local healthcare officials.</li> <li>Serves on \"country team\" as medical expert.</li> <li>Acts as a diplomat.</li> <li>Organizes medical representational events.</li> <li>Ensures health-unit security.</li> </ul> <br><br><b>Requirements</b><br><br><b>Conditions of Employment</b><ul> <li>Be a U.S. citizen and accept assignments based on the needs of the FS.<em></li> <li>Be able to obtain a Top Secret Security Clearance.</li> <li>Meet the minimum medical qualification standard. </li> <li>Be able to obtain a favorable Suitability Review Panel determination.<strong></li> <li>Be at least 20 years old and at least 21 years old to be appointed.</li> <li>Be appointed prior to age 60 (preference eligible veterans excepted).<strong><em></li> </ul><strong>Essential Physical Requirements<br><br></strong>Basic physical ability requirements are vision, hearing, speaking, mental endurance, dexterity, and mobility. In addition, MPs may need to perform other physical essential functions effectively with or without reasonable accommodation, in environments that pose physical or other occupational challenges. These duties may include:<ul> <li>Provision of direct patient care that may require heavy lifting, pulling, stooping, and twisting in austere environments</li> <li>Traveling independently to regional posts utilizing commercial air carriers, military aircraft, or other transportation modalities that may not offer special access accommodations</li> <li>Provision of emergency care in any location following an accident, natural disaster, or attack and emergency care in potentially hostile or physically challenging environments, such as in buildings without elevators or in areas with irregular spaces that require kneeling, bending, stooping, lifting, walking and running over uneven terrain</li> <li>Transportation of self or patients via small aircraft, helicopters, ambulances, or other non-standard modes of transportation with small entrances and high floors, such as high axle armored vehicles.</li> </ul><b>Qualifications</b><br><br><strong>Licensure and Certification</strong><br>Applicants must be currently licensed as a Family Nurse Practitioner (FNP) or Physician Assistant (PA) in a state, a territory of the U.S., Puerto Rico, or the District of Columbia and must have current national certification as a FNP or the PA-equivalent from the American Nurses Credentialing Center, American Academy of Nurse Practitioners or the National Commission on Certification of Physician Assistants. Applications will not be accepted from Nurse Practitioners or Physician Assistants who are not currently licensed and certified. Licenses and national board certification and re-certification as a Family Nurse Practitioner or Physician Assistant must be maintained during employment with the Department's Bureau of Medical Services. Once hired, applicants will be required to obtain and maintain a District of Columbia license.<br> <br><strong>Continuing Medical Education (CME)</strong><br>MPs receive at least 25 hours of Category 1 CME credit through an annual State Department-sponsored Continuing Medical Education conference.<br> <br><strong>Specialized Experience </strong><br>Applicants must have a minimum of five (5) years of full-time clinical experience within the past seven (7) years, post NP or PA family practice certification. Full time is defined as a minimum of 40 hours/week with at least 75% of the time involved in direct primary care or 30 hours/week with 100% of time involved in direct primary care. Otherwise qualified clinicians who have practiced primarily emergency medicine, hospital based practice or other non-ambulatory settings must demonstrate thorough understanding of primary care practice fundamentals as defined in the next paragraph.<br><br>\"Primary care\" encompasses adult and pediatric diagnosis and treatment of acute illness and management of chronic diseases, routine gynecologic care, prenatal care, adult health maintenance and preventive health care, well child care and immunization management. It embraces the total family unit across the lifespan, including emotional and physical aspects that impact overall well-being. The Medical Provider utilizes and coordinates sub-specialty professional consultations when needed.<br><br><strong>Knowledge, Skills, and Abilities (KSA)</strong><br>The Department has conducted extensive job analysis research to determine KSAs and other attributes conducive to successful performance as an MP. An applicant's education level, work experience, and other qualifications will be considered as part of the hiring decision-making process based on these KSA criteria.<br><br>Applicants must have demonstrated a high degree of clinical and management expertise. The patient population covered is unique because of background and lifestyle as part of a diplomatic community overseas. This population also differs in terms of clinical and administrative needs and the national security concerns inherent in their employment. Previous experience working in similar occupational settings and/or in an overseas setting is advantageous.<br><br>The candidate must demonstrate the ability to manage administrative aspects of a HU as well as the ability to cope with extraordinary medical crises, often in remote and isolated settings. Education and experience must demonstrate that the applicant can function as a public/community health provider.<br><br>The applicant must be a skilled and experienced primary health care practitioner with excellent interpersonal skills. The applicant must be able to function well within a complex organization and have experience working in a high stress environment, and recognize and understand the problems of delivering healthcare to Americans posted in locations where local medical resources are limited or non-existent. The ability to logically and objectively analyze patient problems, and apply sound clinical judgment is required. Experience in providing long distance triage and care via electronic communications such as telephone, telemedicine, radio, and e-mail is preferred.<br><br>Applicants must have the capacity to gain the cooperation and confidence of patients, co-workers, supervisors, and subordinates. Individuals must have experience working in a multidisciplinary practice as well as experience in team building, leadership and management. Effective written and oral communication skills are essential, as well as the ability to present medical findings in a clear and concise manner to medical and non-medical personnel. Demonstrated ability to teach or lecture to groups on medical issues is preferred.<br><br>Applicants must be able to develop, coordinate, and administer healthcare delivery programs. These include but are not limited to individual and community health promotion and disease prevention programs to include teaching health topics to both small and large groups. <br><br>Applicants must be able to organize and supervise a diverse group of health care providers with varying degrees of expertise, education, and command of English. Applicants must understand the unique cultural differences related to healthcare delivery in varied countries and address these differences in a positive manner. Applicants must be able to assess, diagnose, and treat infectious diseases.<br><br>Applicants must possess a high degree of integrity, decisiveness and fairness in order to equitably apply the regulations and policies of the medical program to all eligible persons.<br><br>Knowledge and hands-on familiarity with computer systems are preferred.<br><br>Specific medical knowledge areas required by the job include: family practice, pediatrics, women's health issues, obstetrics, infectious disease, orthopedics, dermatology, gastroenterology, neurology, urology, laboratory/radiology/other diagnostic testing, pharmacology, general surgery, mental health conditions, alcoholism and drug abuse, nutrition, emergency medical techniques, immunizations, health-related environmental factors, food and water safety, occupational safety and health, and quality assurance procedures.<br><br>Specific medical skills required by the job include: family practice, clinical interviewing, physical assessment, performing medical clearance examinations, performing medical procedures, operating medical equipment, planning of evaluation and treatment, triage, data interpretation, and research techniques. Applicants must provide comprehensive health assessments and medical care to individuals and families across the lifespan.<br><br>Management skills required by the job include: supervision, leadership, teaching others, managing personnel and financial resources, contingency planning and crisis management, organizing and managing events/programs/projects, time management, collaborating, working with limited resources, acclimating to different cultures, and computer use.<br><br>Personal skills required by the job include: reading comprehension, active listening, oral and written communication, public speaking, active learning, complex problem identification, critical thinking, judgment and decision making, math, social perceptiveness, interpersonal skills, persuasion, service orientation, monitoring, coordination, and process operation and control.<br><br>Other attributes required by the job include: compassionate, resilient, self-confident, firm convictions, independent but integrated with the department, interest in continuous learning and change, interest in foreign service work, tolerance of on-call and emergency demands, tolerance of travel, worldwide available, and tolerance of living away from family.<br><br>Superior oral and written communication skills: Applicants must demonstrate a strong command of the English language to include grammar, spelling, and punctuation. Foreign Service Specialists must consistently meet a high standard for English, both written (overall structure as well as grammar, spelling, and punctuation), and spoken (overall structure as well as delivery, clarity, and succinctness).<br><br><b>Education</b><br><br>At the time of application, applicants must possess:<ul> <li>Diploma from accredited Family Nurse Practitioner (FNP) or Physician Assistant (PA) program with a minimum of a Master's degree in a health related field from a school in the U.S. or Canada that was approved by a recognized U.S. accrediting body in the year of the applicant's graduation.</li> <li>Equivalent degree from a foreign school that provided educational and medical knowledge equivalent to accredited schools in the U.S. </li> </ul><strong>You must submit a copy of your university transcript(s) with your application.</strong> <strong>If you do not submit this documentation to demonstrate your educational achievements, your candidacy will not continue. </strong>Please review below the <strong>full list</strong> of required documents.<br><br>Unofficial or official transcripts are acceptable. Your transcript must include your name, the school's name, the degree and date awarded, and have <strong>no</strong>missing pages. A transcript missing any of these elements will not pass the minimum qualifications and the candidacy will not continue. Copies of diplomas may not be submitted in lieu of transcripts for education above high school level.<br><br>Education from a program or institution within the United States must be accredited at the time of program completion by an accrediting institution recognized by the U.S. Department of Education, http://ope.ed.gov/accreditation.<br><br>Education completed in foreign high schools, colleges or universities may be used to meet the education requirements if you can show that the foreign education is comparable to that received in an accredited educational institution in the United States. It is your responsibility to provide such evidence when applying. Only accredited organizations recognized as specializing in the interpretation of foreign education credentials that are members of the National Association of Credential Evaluation Services (NACES) or the Association of International Credential Evaluators, Inc. (AICE) are accepted. If documentation from an accredited organization is not provided, your candidacy will not continue.<br><br>NACES: <a href=\"https://www.naces.org/index\">https://www.naces.org/index</a><br> <br>AICE: <a href=\"https://aice-eval.org/\">https://aice-eval.org/</a><br> <br>For further information on the evaluation of foreign education, please refer to the Office of Personnel Management and the U.S. Department of Education. The U.S. Department of State neither endorses nor recommends any individual evaluation service.<br><br>OPM: <a href=\"http://www.opm.gov\">www.opm.gov</a> <br> <br>U.S. Department of Education: <a href=\"http://www.ed.gov\">http://www.ed.gov</a><br><br><b>Additional information</b><br><br></em>EMPLOYMENT ELIGIBILITY VERIFICATION PROGRAM (E-Verify) - Verification of employment eligibility in the United States is required.<br>U.S. law requires companies to employ only individuals who may legally work in the United States - either U.S. citizens, or foreign citizens who have the necessary authorization. This agency utilizes E-Verify to compare information from the Form I-9, Employment Eligibility Verification, to data from U.S. Department of Homeland Security (DHS) and Social Security Administration (SSA) records to confirm employment eligibility. If the employee's information does not match DHS and/or SSA records, the employee is given an opportunity to resolve the problem. If eligibility cannot be verified, employment will be terminated.<br><br></strong>The Department of State Suitability Review Panel and standards are defined in Chapter 3 of the Foreign Affairs Manual. For more information please visit: <a href=\"https://fam.state.gov/\">https://fam.state.gov</a>/<br> <br></strong></em>For more information about Veteran's Preference and how it is applied in the selection process, please visit: <a href=\"https://careers.state.gov/about/diversity-inclusion/veterans-program-office/\">https://careers.state.gov/about/diversity-inclusion/veterans-program-office/</a>.<br><br>No applicant will be considered who has previously been separated from the Foreign Service under sections §607, §608, §610 or §611 of the Foreign Service Act of 1980, as amended, or who resigned or retired in lieu of separation under these provisions. In addition, no applicant will be considered who has previously been separated for failure to receive a career appointment under section §306 of the Foreign Service Act of 1980, as amended, or who resigned or retired in lieu thereof.<br> <br>A Foreign Service Specialist separated for failure to receive a career appointment under section 306 may not re-apply to be a Foreign Service Specialist in the same skill code but may apply for another skill code or to be a Foreign Service Generalist.<br> <br>Executive Branch agencies are barred by 5 US Code 3303 as amended from accepting or considering prohibited political recommendations and are required to return any prohibited political recommendations to sender. In addition, as mandated by 5 US Code 3110, relatives of federal employees cannot be granted preference in competing for these employment opportunities.<br><br>It is the policy of the Federal Government to treat all employees with dignity and respect and to provide a workplace that is free from discrimination whether discrimination is based on race, color, religion, sex (including gender identity or pregnancy), national origin, disability, political affiliation, marital status, membership in an employee organization, age, sexual orientation, or other non-merit factors.<br><br>The Department of State provides reasonable accommodation to applicants with disabilities. Applicants requiring reasonable accommodations for any part of the application or hiring process should so advise the Department at <a href=\"mailto:ReasonableAccommodations@state.gov\">OAA@state.gov</a>, within one week of receiving their invitation to the specialist assessment. Decisions for granting reasonable accommodations are made on a case-by-case basis.<br><br><ul> <li> Benefits<br><br>Benefits include health and medical coverage, federal retirement benefits, and paid leave. Overseas benefits include tax-free housing, tax-free education allowance for dependent children between K-12 overseas, and an unrivaled opportunity to see the world and experience different cultures. <br> <br>The salary range listed comes from the Foreign Service Overseas and Washington pay scales. The starting salary for MPs is FP-03, steps 5 through 14. The starting step is determined in part by highest educational level achieved and also professional experience level beyond the minimum qualifications. Additional steps may be granted based on the following: one step for a Master's degree in public health from a program accredited by a nationally recognized U.S. accrediting agency. Individuals already working in government positions may be appointed based on highest previous rate as a Federal employee. For information on salary, please visit <a href=\"https://careers.state.gov/benefits/fs-entry-salaries/?_ref=buleqzvnpt0\">https://careers.state.gov/benefits/fs-entry-salaries/</a><br> <br>DOS may authorize payment of recruitment incentives to eligible newly-appointed employees.<br><br><a href=\"http://careers.state.gov/work/benefits/fss\">Review our benefits</a></li> </ul><b>How You Will Be Evaluated</b><br><br>You will be evaluated for this job based on how well you meet the qualifications above.<br><br>Candidates will be evaluated on their total background including experience, education, awards, training, and self-development as it relates to the position. Selection for this position will be made only from among candidates possessing the best qualifications. Part-time work experience will be prorated.<br> <br><strong>Medical Credential Verification and Indemnification</strong><br> Applicants are subject to a credential verification process conducted by the Quality Management Staff Unit of the Bureau of Medical Services. This process includes query of the National Practitioner Data Bank and independent verification of state licenses and national certifications. Once hired, medical personnel are indemnified for official duties only through the U.S. Federal Tort Claims Act, so long as they are acting within their scope of work.<br> <br>Active Bureau of Medical Services clinical privileges, specific to the position, are a condition of employment for all Foreign Service Medical Specialists<br> <br><b>You may <a href=\"https://jobs.monstergovt.com/dos/vacancy/previewVacancyQuestions.hms?orgId=1&amp;jnum=114805\">preview questions</a> for this vacancy.</b></p>",
        "name": "Foreign Service Medical Provider",
        "type": "external",
        "publication_date": "2023-10-26T01:58:12Z",
        "short_name": "foreign-service-medical-provider-ad0d5d",
        "model_type": "jobs",
        "id": 12925400,
        "locations": [
            {
                "name": "United States"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Mid Level",
                "short_name": "mid"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/usdepartmentofstate/foreign-service-medical-provider-ad0d5d"
        },
        "company": {
            "id": 12390,
            "short_name": "usdepartmentofstate",
            "name": "U.S. Department of State"
        }
    },
    {
        "contents": "<p>As a Pharmacy Benefit Account Service Manager, you will serve as the relationship manager and account professional for brokers and/or strategic clients on pharmacy benefit related topics. You will collaborate with the Pharmacy Benefit Consultant by interacting and creating relationships with brokers, client executives, human resource personnel, and others which will enable EPIC to partner with clients to create and communicate within the context of the overall health and welfare strategy. As the Account Service Manager, you are the guru when it comes to planning benefits, auditing, reporting and overall operations.  </p>\n\n<h3>Responsibilities:</h3>\n\n<p>Working with the EPIC Pharmacy Benefit Consultant, EPIC Broker, client, PBM, and EPIC resources the candidate will:</p>\n\n<ul>\n<li>Supports the EPIC Account Team supporting clients with clients and EPIC Brokers</li>\n<li>Participate in ongoing client meetings including:\n<ul>\n<li>PBM implementation support</li>\n<li>Vendor review meetings</li>\n<li>Independent strategy and performance assessment meetings</li>\n</ul>\n</li>\n<li>Navigate appropriate internal EPIC experts on custom projects and Ensuring deadlines are met and projects are completed on time.</li>\n<li>Manage client renewals in collaboration with the Pharmacy Benefit Consulting Team</li>\n<li>Comply with all PSG policies and procedures including protection of PSG’s assets, data security, confidentiality, privacy and processing integrity</li>\n<li>Become a product expert/SME on PSG’s internal technology and internal reporting capabilities</li>\n<li>Perform basic analytics related to client program performance</li>\n<li>Prepare and support the delivery of quarterly and annual business reviews with clients and pharmacy partners to highlight program performance and outline optimization opportunities</li>\n<li>Monitor PSG billing activity related to assigned accounts to ensure accuracy and timely billing</li>\n<li>Maintain Client Relationship Management (CRM) documentation to assigned accounts</li>\n</ul>\n\n<p>Program and Business Development</p>\n\n<ul>\n<li>Assess opportunity for expanding EPIC Pharmacy Solution services within existing client</li>\n<li>Participation in conferences and other forums for showcasing program experience and</li>\n<li>Participate in internal workgroups to develop new programs, services, corporate positions and publications based on the continual assessment of client and market</li>\n</ul>\n\n<p>Account Implementation</p>\n\n<ul>\n<li>Assists Pharmacy Benefit Consultant by providing oversight, guidance and serve as an advocate for the broker and client to ensure vendor requirements are being met and service levels are adequate throughout vendor</li>\n<li>Identify issues and concerns for appropriate escalation and resolution to ensure successful</li>\n</ul>\n\n<p>RFP Process Management</p>\n\n<ul>\n<li>Participate in general RFI/RFP process via scoring and assistance with this annual process.</li>\n</ul>\n\n<h3>Qualifications (Minimum Requirements)</h3>\n\n<ul>\n<li>Extensive knowledge of PBM and specialty pharmacy environment (2 years minimum experience).</li>\n<li>Strong verbal and written communication skills including presentation skills and client relationship management</li>\n<li>Strong experience with Broker, TPA and Captive markets</li>\n<li>Strong analysis skills including: Word, PowerPoint and Excel</li>\n<li>Detail oriented and self-directed</li>\n<li>Willingness to be part of a team unit and cooperate in the accomplishment and departmental and organizational goals and objectives</li>\n<li>Travel is required, but typically less than 20%</li>\n</ul>\n\n<p> </p>\n\n<p>WHY JOIN US? </p>\n\n<ul>\n<li>15th Largest Broker in US</li>\n<li>Voted \" Best Place to Work\" in the Insurance Industry</li>\n<li>Awesome Benefits:  401K matching, Generous Time Off Policy, Flexible Work Options, Medical, Dental, Vision, Pet Insurance, Cancer Insurance, Wellness Programs, Employee Award Programs (Trips!).</li>\n</ul>\n\n<p><em>The national average salary for this role is $70-90k in base pay and exclusive of any bonuses or benefits. The base pay offered will be determined based on your experience, skills, training, certifications and education, while also considering internal equity and market data.</em></p>\n\n<p><em>EPIC embraces diversity in all its various forms—whether it be diversity of thought, background, race, religion, gender, skills or experience. We are committed to fostering a work community where every colleague feels welcomed, valued, respected and heard. It is our belief that diversity drives innovation and that creating an environment where every employee feels included and empowered, helps us to deliver the best outcome to our clients. An Equal Opportunity/Affirmative Action Employer.</em></p>\n\n<p><em>#LI-GB1</em></p>\n\n<p><em>#LI-Remote</em></p>",
        "name": "Pharmacy Benefit Account Service Manager (1287)",
        "type": "external",
        "publication_date": "2023-09-19T23:08:03Z",
        "short_name": "pharmacy-benefit-account-service-manager-1287",
        "model_type": "jobs",
        "id": 11161509,
        "locations": [
            {
                "name": "Flexible / Remote"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Senior Level",
                "short_name": "senior"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/epicinsurancebrokersandconsultants/pharmacy-benefit-account-service-manager-1287"
        },
        "company": {
            "id": 12013,
            "short_name": "epicinsurancebrokersandconsultants",
            "name": "Epic Insurance Brokers and Consultants"
        }
    },
    {
        "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b><b>Position Summary</b><br>9am-6pm EST Monday - Friday (may vary based on time zone)</b><br><b><br>The Pharmacy Technician - Medication Assistance position is responsible for using their knowledge of pharmacy business and excellent customer service skills to provide beneficiaries in a Medicare ACO plan with resources and assistance to afford their medications. In this position you will work from home talking one on one with Medicare beneficiaries over the phone to explore options to help them afford their medications. Other duties may also be assigned by the leadership team.</b><ul><li><b>Work with a care team of pharmacists, RN case managers, social workers, community health workers, and others to support the needs of Medicare beneficiaries</b></li><li><b>Take referrals from staff to speak one on one with Medicare beneficiaries and/or their caregivers over the phone to gather information, provide resources, help with applications, and address issues related to medication costs</b></li><li><b>Contact provider offices or speak with pharmacies as needed to gather information</b></li><li><b>Maintain and update an internal listing of available cost-saving resources</b></li></ul><b>Required Qualifications</b><ul><li><b>Certified/licensed/registered pharmacy technician or as required by state law</b></li><li><b>Minimum of 3 years of experience as a pharmacy technician</b></li><li><b>Demonstrated excellence in communicate clearly and effectively both verbally and in writing</b></li><li><b>Ability to apply basic computer skills. Must have ability to learn new computer systems including Epic.</b></li><li><b>Ability to work independently to solve problems and complete referrals in a timely manner</b></li><li><b>Collaborate with other members of the care team to support the holistic needs of the beneficiary</b></li><li><b>Ability to adapt and change with workflow and shifting priorities</b></li><li><b>Candidate must have access to personal broad-band internet</b></li><li><b>Candidate must be able to ensure a private workspace within work-from-home environment</b></li></ul><b>Preferred Qualifications</b><ul><li><b>National Pharmacy Technician Certification (PTCB or ExCPT)</b></li><li><b>Knowledge of Microsoft Office Suite including Microsoft Word, Outlook, Excel and Teams.</b></li><li><b>Previous experience with Epic or other EMR systems</b></li></ul><b>Education</b><br><b>Verifiable High School Diploma or equivalent</b><br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$18.50 - $34.60<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors. This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities. The Company offers a full range of medical, dental, and vision benefits. Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees. The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners. As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies. <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
        "name": "Pharmacy Technician - Medication Assistance",
        "type": "external",
        "publication_date": "2023-11-02T12:50:25Z",
        "short_name": "pharmacy-technician-medication-assistance-fe7787",
        "model_type": "jobs",
        "id": 12939127,
        "locations": [
            {
                "name": "United States"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Mid Level",
                "short_name": "mid"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-medication-assistance-fe7787"
        },
        "company": {
            "id": 12096,
            "short_name": "cvshealth",
            "name": "CVS Health"
        }
    },
    {
        "contents": "<p>Hi, we're Oscar Medical Group. We’re hiring a Bilingual Nurse Practitioner or Physician Assistant to join our Virtual Primary Care team. </p>\n\n<p>At Oscar Medical Group, we are refactoring healthcare. We want to help each of our members achieve their healthcare goals in a personalized way. To help us achieve that goal we are looking for innovative leaders who think big and push boundaries to refactor healthcare and the healthcare delivery system.</p>\n\n<p><strong>About the role:</strong></p>\n\n<p>You will manage a panel of members within the states of Texas, California, Florida and other Oscar states where we offer virtual Oscar Virtual Primary Care or expand to (including New York, Oklahoma, Connecticut, Arizona, Georgia, and Tennessee). You’ll keep a set patient schedule and will be the primary care provider for your panel. We’re building this program from the ground up, so you’ll engage with new products and tooling that we’re rolling out for the virtual care service lines. </p>\n\n<p>You will report into the Lead APP.</p>\n\n<p><strong>Work Location:</strong></p>\n\n<p>Oscar Medical Group is a blended work culture where everyone, regardless of work type or location, feels connected to their teammates, our culture and our mission. </p>\n\n<p>This is a remote / work-from-home role. You must reside in one of the following states: Arizona, California, Colorado, Florida, Georgia, Nevada, New York, Ohio, Pennsylvania, Texas, or Virginia. Note, this list of states is subject to change. #LI-Remote</p>\n\n<p><strong>Pay Transparency:</strong></p>\n\n<p>The base pay for this role is: $104,000- $136,500 per year. You are also eligible for employee benefits, annual vacation grant of up to 18 days per year and annual performance bonuses</p>\n\n<p><strong>Responsibilities:</strong></p>\n\n<ul>\n<li>Provide care for your panel of patients (18+) virtually (phone, messaging, video)</li>\n<li>Provide continuity of care to patients with a wide range of acuity from young/healthy to chronic conditions (DM, HTN, COPD, CAD, etc). </li>\n<li>Collaborate with physicians MD/DO on the Care Team on complex patients / escalated cases.  </li>\n<li>Follow up on labs, imaging, and closed loop communication with patients and other providers. </li>\n<li>Use tooling to allow virtual “exams” including remote home monitoring equipment, remote physical exam, remote point of care diagnostics (ie TytoCare or Butterfly). </li>\n</ul>\n\n<ul>\n<li>Collaborate with registered nurses, medical assistant and clinical supervisory where applicable </li>\n<li>Be available for on-call shifts and to answer important lab escalations.</li>\n<li>Maintain a flexible patient schedule -- this may include scheduled early morning visits and early evening visits</li>\n<li>Participate in collaborative care with virtual behavioral health specialists</li>\n<li>Flex between Oscar’s virtual products: primary care, urgent care, and health assessments.</li>\n</ul>\n\n<p><strong>Requirements:</strong></p>\n\n<ul>\n<li>DNP, FNP, ENP, or PA from accredited program</li>\n<li>Board Certification (NCCPA or AANP or ANCC)</li>\n<li>3+ years of primary care experience </li>\n<li>2+ years of experience delivering virtual care </li>\n<li>Texas, California, Arizona, AND Georgia states licenses</li>\n<li>Compact RN license (if an APRN)</li>\n<li>Spanish language fluency</li>\n</ul>\n\n<p><strong>Bonus points:</strong></p>\n\n<ul>\n<li>Experience working with remote diagnostic and home monitoring tools</li>\n<li>Additional licenses in Arizona, Florida, Georgia, New York, Connecticut, Tennessee and/or Oklahoma </li>\n<li>If not licensed in Arizona, has the necessary pharmacology course hour requirement and/or coursework to obtain an Arizona license </li>\n</ul>\n\n<div><p><span>This is an authentic Oscar Health job opportunity. Learn more about how you can safeguard yourself from recruitment fraud</span><a href=\"http://hioscar.com/careers/recruitment-fraud-alert\"><span> </span><span>here</span></a><span>. </span></p>\n<p><span>At Oscar, being an Equal Opportunity Employer means more than upholding discrimination-free hiring practices. It means that we cultivate an environment where people can be their most authentic selves and find both belonging and support. We're on a mission to change health care -- an experience made whole by our unique backgrounds and perspectives..</span></p>\n<p><strong>Pay Transparency: </strong></p>\n<p><span>Final offer amounts, within the base pay set forth above, are determined by factors including your relevant skills, education, and experience.</span></p>\n<p><span>Full-time employees are eligible for benefits including: medical, dental, and vision benefits, 11 paid holidays, paid sick time, paid parental leave, 401(k) plan participation, life and disability insurance, and paid wellness time and reimbursements.</span></p>\n<p><strong>Reasonable Accommodation:</strong></p>\n<p><span>Oscar applicants are considered solely based on their qualifications, without regard to applicant’s disability or need for accommodation. Any Oscar applicant who requires reasonable accommodations during the application process should contact the Oscar Benefits Team (accommodations@hioscar.com) to make the need for an accommodation known.</span></p></div>",
        "name": "NP or PA - Virtual Primary Care - Bilingual Only (Spanish)",
        "type": "external",
        "publication_date": "2023-10-17T23:06:18Z",
        "short_name": "np-or-pa-virtual-primary-care-bilingual-only-spanish",
        "model_type": "jobs",
        "id": 12754987,
        "locations": [
            {
                "name": "Flexible / Remote"
            },
            {
                "name": "Selma, AL"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Mid Level",
                "short_name": "mid"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/oscarhealth/np-or-pa-virtual-primary-care-bilingual-only-spanish"
        },
        "company": {
            "id": 11878,
            "short_name": "oscarhealth",
            "name": "Oscar Health"
        }
    },
    {
        "contents": "<p>Bring your heart to CVS Health Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$18.82 - $24.32<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities. The Company offers a full range of medical, dental, and vision benefits. Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees. The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners. As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies. <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health colleagues can initiate a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through myHR (1-888-694-7287, or through myLeave at myHR). If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
        "name": "Pharmacy Technician",
        "type": "external",
        "publication_date": "2023-11-02T12:39:45Z",
        "short_name": "pharmacy-technician-04fae1",
        "model_type": "jobs",
        "id": 12834553,
        "locations": [
            {
                "name": "United States"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Senior Level",
                "short_name": "senior"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-04fae1"
        },
        "company": {
            "id": 12096,
            "short_name": "cvshealth",
            "name": "CVS Health"
        }
    },
    {
        "contents": "<div><i>Arcadia is dedicated to happier, healthier days for all. We transform diverse data into a unified fabric for health. Our platform delivers actionable insights for our customers to advance care and research, drive strategic growth, and achieve financial success. For more information, visit </i><a href=\"http://arcadia.io/\"><i>arcadia.io</i></a><i>.</i></div>\n\n<div><br></div>\n\n<div><b>Why This Role Is Important to Arcadia </b></div>\n\n<div><br></div>\n\n<div><span>In this position you will be working with a team of independent and autonomous Referral Coordinators within the Intake Department to break down barriers and ensure quality and timely care.  In collaboration with your teammates, you will strive for continuous improvement and an excellent work-life balance to produce top-notch results.</span></div>\n\n<div><br></div>\n\n<div><b>What Success Looks Like</b></div>\n\n<div><b>In 3 months</b></div>\n\n<div>- Team member should be able to understand how to navigate referral episodes in the internal documentation system and be able to assist 20-30 customers per day with assistance</div>\n\n<div>- Understanding their daily functions such as navigating the call queue, answering phone calls and assisting customers with entry-level questions</div>\n\n<div><br></div>\n\n<div><b>In 6 months</b></div>\n\n<div>- Team member should feel very confident with their call queues and be able to assist 20-30 customers per day with accurate information provided</div>\n\n<div>- Able to take on more responsibilities such as learning Claims and Eligibility basics and troubleshooting issues with complex cases</div>\n\n<div><br></div>\n\n<div><b>In 12 months</b></div>\n\n<div>- Team member should be able to assist 20-30 customers accurately, have excellent knowledge of each department processes and guidelines, trouble shoot and help others in the department, confident in handling phone calls and providing the correct information to our clients</div>\n\n<p><strong>What You'll Be Doing</strong><ul><li>Interpreting referral and pre-certifications complying with multiple sets of protocols which are built in the application</li><li>Maintains and manages strict confidentiality of all information, whether received directly or indirectly as it relates to health care services</li><li>Enter referral and pre-certification calls into software program accurately</li><li>Answer phone calls as well as make phone calls</li><li>Responsible for expediting calls to ensure accuracy and timeliness of referral and pre-certification authorizations</li><li>Assists physician offices and providers with referral and pre-certification questions</li><li>Works with Customer Service, Provider Relations and Claims staff to clarify or rectify discrepancies between referrals, pre-certifications and claims</li><li>Adheres to all audit procedures</li><li>Performs other duties as assigned</li></ul></p>\n<p><strong>What You'll Bring</strong><ul><li>Knowledge of medical terminology</li><li>Preferred medical office experience</li><li>One years' experience in managed care with referral interpretation</li><li>Knowledge of medical coding; including ICD-10, HCPC's and CPT codes</li><li>Able to adapt to different situations and multitask</li><li>Must have ability to work independently, maintain organization and meet deadlines</li><li>Highly skilled in verbal and written communication</li><li>Able to problem solve, exercise initiative and make decisions</li><li>Able to communicate clearly and work effectively with co-workers, management, physicians, members, vendors and customers</li></ul></p>\n<p><strong>Would Love For You To Have</strong><ul><li>Knowledge of Excel basic function and PDF Converter and/or Adobe Pro</li><li>Positive disposition</li><li>Hardworking</li><li>Eager to learn</li><li>Very dependable</li><li>Works well with others</li></ul></p>\n<p><strong>What You'll Get</strong><ul><li>Flexible hours, working remote, collaborating with a great team!  </li><li>Be a part of a mission driven company that is transforming the healthcare industry by changing the way patients receive care</li><li>A flexible, remote friendly company with personality and heart</li><li>Employee driven programs and initiatives for personal and professional development </li><li>Be a member of the Arcadian and Barkadian Community </li></ul></p>\n<div><i>This position is responsible for following all Security policies and procedures in order to protect all PHI under Arcadia's custodianship as well as Arcadia Intellectual Properties.  For any security-specific roles, the responsibilities would be further defined by the hiring manager.</i></div>\n\n<div><br></div>\n\n<div><b>About Arcadia</b></div>\n\n<div><a href=\"http://arcadia.io/\">Arcadia.io</a> helps innovative healthcare systems and health plans around the country transform healthcare to reduce cost while improving patient health.   We do this by aggregating massive amounts of clinical and claims data, applying algorithms to identify opportunities to provide better patient care, and making those opportunities actionable by physicians at the point of care in near-real time.  We are passionate about helping our customers drive meaningful outcomes. We are growing fast and have emerged as the market leader in the highly competitive population health management software and value-based care services markets, and we have been recognized by industry analysts KLAS, IDC, Forrester and Chilmark for our leadership. For a better sense of our brand and products, please explore our <a href=\"https://www.arcadia.io/about-arcadia/leadership/\">website</a>, our <a href=\"https://www.arcadia.io/resources/\">online resources</a>, and our interactive <a href=\"https://datagallery.arcadiasolutions.com/static/index.html\">Data Gallery</a>.</div>\n\n<div><br></div>\n\n<div><i>This position is responsible for following all Security policies and procedures in order to protect all PHI under Arcadia's custodianship as well as Arcadia Intellectual Properties.  For any security-specific roles, the responsibilities would be further defined by the hiring manager.</i></div>",
        "name": "Referral Coordinator",
        "type": "external",
        "publication_date": "2023-10-31T23:02:44Z",
        "short_name": "referral-coordinator-4a326f",
        "model_type": "jobs",
        "id": 12195897,
        "locations": [
            {
                "name": "Flexible / Remote"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Mid Level",
                "short_name": "mid"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/arcadia/referral-coordinator-4a326f"
        },
        "company": {
            "id": 15000037,
            "short_name": "arcadia",
            "name": "Arcadia"
        }
    },
    {
        "contents": "<p>Edwards Lifesciences is the global leader in the science of heart valves and hemodynamic monitoring. Driven by a passion to help patients, the company partners with clinicians to develop innovative technologies in the areas of structural heart disease and critical care monitoring that enable them to save and enhance patient lives. Due to continued growth, we have created a new role for a Field Clinical Specialist TMTT (Transcatheter Mitral and Tricuspid Therapies) to join our exciting, groundbreaking heart valve technologies team.<br><br><b>Job Function:</b><br><br>The Clinical Field Specialist will report directly to the Business Unit Director of TMTT ANZ and will be responsible for providing clinical support to ensure exceptional clinical results for patients suffering from mitral and tricuspid regurgitation. The primary focus is supporting structural heart teams introduce and grow their structural heart programs and you will need to manage multiple stakeholders to ensure programs thrive and grow as these therapies mature.  You will need to develop and maintain excellent relationships with key opinion leaders within the interventional structural heart arena and will have expertise introducing new therapies and products into the Australia and New Zealand markets. The team you will be working in is small and growing, you will need to be a real team player and able to step up and cover colleagues' territories as case volumes increase as well as having an open and solution orientated mindset to solve both clinical and commercial challenges.<br><br>You will need a solid understanding of echo and be familiar with the catheter and hybrid lab environments as well as a strong understanding of heart anatomy and physiology.<br><br><b>Key Responsibilities:</b><br><br><ul><li>Provide education on all aspects of our transcatheter edge to edge repair (TEER) and heart valves, device handling, implantation and troubleshooting techniques related to equipment, tools and products required for device implants.</li><li>Develop, deliver and continuously improve training curriculum, training materials and training tools.</li><li>Educate and train physicians, hospital personnel and hospital staff on technical matters related to products and procedures through conducting and/or coordinating one-on-one ad hoc training sessions and in-service structured education programs.</li><li>Throughout commercial procedures, provide physicians and medical staff with required follow-up support to ensure continuity of education and technical support related to all aspects of clinical research.</li><li>Plan and implement growth strategies within focused accounts</li><li>Responsible for upselling in key strategic accounts working in conjunction with Business Managers</li><li>Learns the product(s), physiology, anatomy, applications and \"language\" of the market and Edwards Lifesciences</li><li>Regularly reviews clinical support activities, changes in the market and assigned accounts</li></ul><br><b>Education/Experience </b><br><br><ul><li>Bachelor's Degree in related field,</li><li>3 years of previous related medical device and/or clinical experience in cardiac sonography/ heart valves - ideally mitral and/or tricuspid</li><li>Experience of the Cath lab environment or as a scrub nurse for procedures</li></ul><br><b>Required Skills</b><br><br><ul><li>Training experience in clinical / technical environment preferred - cath lab</li><li>Ability to interpret cardiac echo reports</li><li>Proven expertise in MS Office Suite</li><li>Good written and verbal communication skills, presentation, and interpersonal relationship skills including negotiating and relationship management skills</li><li>Good problem-solving and critical thinking skills</li><li>Commercial acumen</li><li>Works independently without close supervision</li><li>Ability to travel for work</li></ul><br>In return, you will be rewarded with a competitive salary package and the opportunity to join a fantastic culture that truly puts patients first whilst appreciating that our people are our priority. If you are driven and passionate and want to be a part of leading innovation in this dynamic and exciting space, we would love to hear from you today.</p>",
        "name": "Clinical Field Specialist, VIC",
        "type": "external",
        "publication_date": "2023-09-08T00:25:52Z",
        "short_name": "clinical-field-specialist-vic",
        "model_type": "jobs",
        "id": 12311594,
        "locations": [
            {
                "name": "Flexible / Remote"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Mid Level",
                "short_name": "mid"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/edwardslifesciences/clinical-field-specialist-vic"
        },
        "company": {
            "id": 12161,
            "short_name": "edwardslifesciences",
            "name": "Edwards Lifesciences"
        }
    },
    {
        "contents": "<p><b>The future is our choice</b><br>At Atos, as the global leader in secure and decarbonized digital, our purpose is to help design the future of the information space. Together we bring the diversity of our people's skills and backgrounds to make the right choices with our clients, for our company and for our own futures.<br><br><b>Provation Coder:</b><br><br><b>Location:Remote (US Wide)</b><br><br>Experienced Provation Oncology Coder, endoscope coding experience.<br><br>Coder will assign medical diagnoses and procedure codes using appropriate coding classifications for assigned areas/record types.<br><br>Responsibilities:<br><br>Reviews medical records to determine all appropriate diagnostic and procedural code assignments using the appropriate classification systems.<br><br>Communicates with department manager/supervisor on coding, compliance and documentation issues.<br><br>Seeks clarification from healthcare providers or other designated resources to ensure accurate and complete coding.<br><br>Enhances coding knowledge and skills with continuing education activities and by reviewing pertinent literature.<br><br>Within scope of job, requires critical thinking skills, decisive judgement and the ability to work with minimal supervision.<br><br><b>3+ years coding experience</b><br><br><b>2+ years of Oncology coding experience.</b><br><br>Minimum of 1 Coding Certification from AHIMA or AAPC; RHIA, RHIT, CPC, CCS<br><br>EPIC/  3M 360 CAC experience required.<br><br><b>#LI-US #LI-REMOTE</b><br><br>Here at Atos, diversity and inclusion are embedded in our DNA. <a href=\"https://atos.net/en/careers/atos-today\">Read more</a> about our commitment to a fair work environment for all.<br><br>Atos is a recognized leader in its industry across Environment, Social and Governance (ESG) criteria. <a href=\"https://atos.net/en/about-us/corporate-responsibility-and-sustainability\">Find out</a> more on our CSR commitment.<br><br><b>Choose your future. Choose Atos.</b></p>",
        "name": "Profee Surgical Coder",
        "type": "external",
        "publication_date": "2023-09-27T01:05:46Z",
        "short_name": "profee-surgical-coder-35f74a",
        "model_type": "jobs",
        "id": 11140698,
        "locations": [
            {
                "name": "Flexible / Remote"
            },
            {
                "name": "Irving, TX"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Mid Level",
                "short_name": "mid"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/atos/profee-surgical-coder-35f74a"
        },
        "company": {
            "id": 12015,
            "short_name": "atos",
            "name": "Atos"
        }
    },
    {
        "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br>The Sr. Service Advocate serves as the Single Point of Contact for handling member service inquiries, issues and process requests received via telephone. Acts with fast knowledge using integrated service tools. Engages, consults and educates members based upon the member's unique needs, preferences and understanding of the ISM suite of services.<br><br><b>Required Qualifications</b><br><br>•  Ability to build a trusting relationships by taking accountability to fully understand the member's needs.<br><br>•  Ability to resolve complex issues with sensitivity and discretion.<br><br>•  Uses communication skills to build relationships with both internal and external members/constituents. <br><br>•  Ability to multitask and handle multiple functions and/or multiple products while maintaining and/or exceeding performance standards.<br><br>•  Demonstrates professionalism and presents a positive image when interacting with members and constituents.<br><br>•  Demonstrates strong member focus and utilizes all available resources to ensure prompt member satisfaction.<br><br>•  Demonstrates functional expertise and leadership ability.<br><br> •  Customer Service experiences in a transaction-based environment such as a call center or retail location preferred, demonstrating ability to be empathetic and compassionate.<br><br><b>Preferred Qualifications</b><br>Strong communication skills<br><br>Understanding of medical terminology<br><br>Problem solving skills<br><br>Computer literate, Microsoft Word and Excel experience a plus<br><br><b>Education</b><br>High School Diploma or G.E.D.<br><br>Some college preferred<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$18.50 - $34.60<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities. The Company offers a full range of medical, dental, and vision benefits. Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees. The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners. As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies. <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
        "name": "ISM - Sr. Service Advocate - Ops",
        "type": "external",
        "publication_date": "2023-11-02T12:16:48Z",
        "short_name": "ism-sr-service-advocate-ops-d9a1a4",
        "model_type": "jobs",
        "id": 12984636,
        "locations": [
            {
                "name": "United States"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Senior Level",
                "short_name": "senior"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/cvshealth/ism-sr-service-advocate-ops-d9a1a4"
        },
        "company": {
            "id": 12096,
            "short_name": "cvshealth",
            "name": "CVS Health"
        }
    },
    {
        "contents": "<p><b>Why customer service at Stryker?</b><br><br>Are you interested in making a difference in healthcare by assisting sales reps and building relationships with customers? As a member of our customer services team, that is exactly what you will do! Here, you will be a part of a dynamic and supportive team that provides solutions to our customers in their time of need.<br><br>We are proud to be named one of the World's Best Workplaces and a Best Workplace for Diversity by Fortune Magazine! Learn more about our award-winning organization by visiting <a href=\"http://\">stryker.com</a><br><br><b>GENERAL DESCRIPTION:</b> <br><br>Utilizes a wide array of knowledge, technical skills and critical thinking abilities to facilitate job functions during surgical procedures as well as preoperative and postoperative equipment management.<br><br><b>ESSENTIAL FUNCTIONS:</b><br><br><ul><li>Provides clinical surgical support by managing all relevant equipment. </li><li>Anticipates related device needs of the O.R. staff and surgeon during surgical procedures. </li><li>Is responsible for trouble-shooting and maintaining Stryker equipment and or other related devices. </li><li>Works with surgeons, O.R. personnel, central processing, biomedical and all other related personnel. </li><li>Maintains knowledge base of equipment and disposable products through Stryker education training programs. </li><li>Provide physicians and OR personnel with information on new and current products. </li><li>Must be able to accurately and honestly record and report data metrics related to all specific job functions on a monthly basis. </li><li>Responsible for maintaining up-to-date account information to ensure continuous high levels of service at the account. </li><li>Accurately records and reports all surgical procedure information. </li><li>Adheres to all Stryker and medical facility policies, standards and procedures. </li><li>Must be able to analyze and resolve both routine and non-routine product issues expediently using independent judgment. </li><li>The ability to provide on-call services, as required, by the medical facility. </li></ul><br><b>QUALIFICATIONS:</b><br><br><ul><li>Bachelor's Degree, Associate's Degree or equivalent certifications preferred. </li><li>Operating Room experience and demonstrated knowledge of anatomy, surgical procedures and techniques preferred. </li><li>Applicable for Specialists working in Sterile Processing Department: IAHCSMM CRCST Certification within 6 months of start date and on time yearly renewal </li><li>Ability to exert up to 50lbs of force occasionally and/or up to 20lbs of force to constantly move objects. </li><li>Ability to remain standing and/or walking for an extended period of time. </li><li>Basic computer skills including Microsoft Office, strong verbal and written communication, interpersonal, and organizational skills are essential. </li><li>Excellent time management skills with ability to use independent judgment and critical thinking effectively. </li><li>Must be able to explain and generate detailed guidelines and procedures. </li><li>Maintain professional appearance, work ethic, and attitude required by Stryker and the medical facility. </li><li>Adhere to (HIPAA) and other related patient confidentiality policies and procedures. </li><li>Must have near visual acuity (corrected) color vision, mobility, bending, standing, stooping, and finger dexterity. </li><li>Must be able to observe and correct minute inconsistencies (e.g. in the printed word, product appearance, etc.). </li><li>Excellent analytical skills. </li><li>Excellent interpersonal skills. </li><li>Excellent equipment problem-solving skills. </li><li>5-10% travel required </li></ul><br>ailed job description here.<br><br><b>About Stryker</b><br><br>Our benefits:<br><br><ul>    <li>12 paid holidays annually</li>    <li>Health benefits include: Medical and prescription drug insurance, dental insurance, vision insurance, critical illness insurance, accident insurance, hospital indemnity insurance, personalized healthcare support, wellbeing program and tobacco cessation program.</li>    <li>Financial benefits include Health Savings Account (HSA), Flexible Spending Accounts (FSAs), 401(k) plan, Employee Stock Purchase Plan (ESPP), basic life and AD&amp;D insurance, and short-term disability insurance.</li></ul><br>For a more detailed overview of our benefits or time off, please follow this link to learn more: <a href=\"https://cdn-static.findly.com/wp-content/uploads/sites/1427/2023/09/20143933/US-Stryker-Employee-benefits.pdf\">US Stryker employee benefits</a><br><br>About Stryker<br>Stryker is one of the world's leading medical technology companies and, together with its customers, is driven to make healthcare better. The company offers innovative products and services in Medical and Surgical, Neurotechnology, Orthopaedics and Spine that help improve patient and healthcare outcomes. Alongside its customers around the world, Stryker impacts more than 130 million patients annually. More information is available at <a href=\"http:\">stryker.com.</a><br><br>Know someone at Stryker?<br>Be sure to have them submit you as a referral prior to applying for this position. Learn more about our employee referral program on our <a href=\"https://careers.stryker.com/referrals/\">referral page</a><br><br>Stryker is driven to work together with our customers to make healthcare better. Employees and new hires in sales and field roles that require access to customer accounts as a function of the job may be required, depending on customer requirements, to obtain various vaccinations as an essential function of their role.</p>",
        "name": "OnSite Specialist- Lexington, KY",
        "type": "external",
        "publication_date": "2023-10-20T13:31:18Z",
        "short_name": "onsite-specialist-lexington-ky-5fdf2c",
        "model_type": "jobs",
        "id": 12838915,
        "locations": [
            {
                "name": "Flexible / Remote"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Mid Level",
                "short_name": "mid"
            }
        ],
        "tags": [
            {
                "name": "Fortune 1000",
                "short_name": "fortune-1000-companies"
            }
        ],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/stryker/onsite-specialist-lexington-ky-5fdf2c"
        },
        "company": {
            "id": 11716,
            "short_name": "stryker",
            "name": "Stryker"
        }
    },
    {
        "contents": "<p><b>Our Company</b><br><br>Changing the world through digital experiences is what Adobe's all about. We give everyone-from emerging artists to global brands-everything they need to design and deliver exceptional digital experiences! We're passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.<br><br>We're on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!<br><br><b>The challenge</b><br><br>The AVP Sales, a front-line leadership role, is responsible for building and developing the team's sales pipeline by guiding a team of Named Account Managers who deliver on their respective sales goals. We are looking for a leader who is familiar with selling business-focused enterprise software applications and/or digital marketing solutions. This incredible opportunity will have you lead from the front, modelling the best in-class behavior, and taking direct ownership for success of the team in all areas. Should be familiar with how to sell to C-Suite executives, board members, and their teams. Should be an entrepreneur at heart, with ability to operate in decentralized and autonomous fashion with a bias for action. Instill a culture of excellence that exceeds goals and targets. Lead, coach, and continuously develop Account Managers focused on Corporate Install Base accounts with high growth opportunity. Develop individuals so that success is achieved in a balanced fashion.<br><br>This role is within the Healthcare Vertical account business, helping to grow named accounts that have an existing footprint of Adobe Experience Cloud solutions, but have high potential to grow into strategic accounts in a short period of time.<br><br><b>What you'll do</b><br><ul><li>We need you to be an \"Exec Sponsor\" helping teams navigate complex sales cycles and be a trusted advocate for the customer.</li><li>Use and advocate Adobe standard value-selling methodology to drive consistency and scale in progressing and closing business across the team.</li><li>Handle consistent, Adobe territory and account planning processes across the team.</li><li>Develop team linearity and drive CRM, pipeline hygiene, and forecasting.</li><li>Enable team on platform selling motion passionate about helping customers achieve significant business outcomes.</li><li>Cultivate and lead deep partner relationships. Partners are key to growing this market.</li><li>Lead a broad ecosystem of specialist, pre-sales, partner sales, Adobe consulting, inside sales, field marketing, and other functions that matrix into the team.</li></ul><br><b>What You Need to Succeed</b><br><ul><li>5+ years of successful sales leadership experience preferred, in business application software, as measured by sales performance against goals. 10+ years overall experience in enterprise level software selling required.</li><li>Demonstrated leadership in complex sales cycles resulting in 7 and 8 figure subscription commitments.</li><li>Must be able to foster exec relationships with genuine interest in customers' success. Owning \"day to day\" exec sponsor role is critical.</li><li>Highly collaborative with the ability to lead in matrixed environment. Must be able to sell internally just as effectively as externally to help teams win.</li><li>Ability to recruit and retain top talent.</li><li>Must be comfortable with extensive travel across the country.</li><li>Growth mindset, eager to learn, with ego in check.</li><li>BA/BS degree required.</li></ul><br>Our compensation reflects the cost of labor across several U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this positionis $280,500 -- $425,300 annually. Paywithin this range varies by work locationand may also depend on job-related knowledge, skills,and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.<br><br>At Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans. Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).<br><br>In addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.<br><br>Adobe is proud to be anEqual Employment Opportunityand affirmative action employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law.Learn more.<br><br>Adobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, emailaccommodations@adobe.comor call (408) 536-3015.<br><br>Adobe values a free and open marketplace for all employees and has policies in place to ensure that we do not enter into illegal agreements with other companies to not recruit or hire each other's employees.</p>",
        "name": "AVP Enterprise Sales - Healthcare",
        "type": "external",
        "publication_date": "2023-09-20T10:34:17Z",
        "short_name": "avp-enterprise-sales-healthcare",
        "model_type": "jobs",
        "id": 12435537,
        "locations": [
            {
                "name": "Flexible / Remote"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Senior Level",
                "short_name": "senior"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/adobe/avp-enterprise-sales-healthcare"
        },
        "company": {
            "id": 12084,
            "short_name": "adobe",
            "name": "Adobe"
        }
    },
    {
        "contents": "<p><strong>ABOUT US</strong><br><br>Galileo is a team-based medical practice working to improve the quality and affordability of health care for all. Operating across 50 states, Galileo offers high-touch, data-driven, multi-specialty, longitudinal care to diverse and complex patients-on the phone, in the home, and everywhere in between. Regional and national health plans, employers, and Fortune 500 organizations trust Galileo as the leading solution to improve population health. Founded by Dr. Tom X. Lee, the healthcare pioneer behind One Medical and Epocrates, Galileo is a team of leading innovators from healthcare, technology, and human-centered design. Our mission is to apply that talent and scientific thinking to transform society by solving our largest, toughest healthcare problems, while at the same time bringing patient and provider closer.<br><br><strong>ABOUT THE ROLE - This is a temp position through 12/31/23</strong><br><br><strong>This is an in-person role supporting the Greenville, NC and surrounding areas</strong><br><br>The Clinical Health Advocate is the center of the care team, owning patient relationships and quarter-backing a collaborative care plan that drives meaningful impact in our patients' lives. We're looking for teammates who are innate people-people, love helping others, and have a knack for tenacious problem-solving.<br><br><strong>Here's what you'll do:</strong><br><br><ul><li>Build rapport and trust with patients to truly understand and appreciate their needs. This includes motivational interviewing, therapeutic engagement, health coaching, and other patient-centered strategies to improve health outcomes </li><li>Work collaboratively with other care team experts like physicians, nurse practitioners, behavioral health providers, and social workers to find creative solutions to help patients meet health goals and overcome social barriers</li><li>Become the ultimate go-to for our patients, building and strengthening relationships with patients, families, and the broader community</li><li>Provide and support patient care across several modalities, including video, phone, and in-person interactions. Galileo has robust COVID precautions in place, including screening, PPE, and regular testing, but this role does involve time in person directly in the community and homes.</li><li>Operate as Galileo's eyes, ears, and hands in the field- providing clinical support (examples include taking vitals, performing phlebotomy, vaccine administration, facilitating video visits with other providers, basic wound care, working with point of care diagnostics and administering medications within your scope of practice, etc.)</li></ul><br><strong>ABOUT YOU</strong><br><br>You are a creative problem solver and a compassionate provider of support. You service mindset and deep desire to create meaningful, positive impact, drive you to build trusting relationships. Leveraging both your intrapersonal relationship skills as well as technical clinical skills, you are most fulfilled when you are improving the lives of your patients and bettering your community.<br><br><strong>We would love to hear from you if you have the following or equivalent experience:</strong><br><br><ul><li>Strong people skills and the ability to connect with anyone, especially individuals who have been historically marginalized and have complex needs</li><li>Creative problem-solving skills that can be leveraged to empower others and impeccable organizational skills that foster reliability and trustworthiness for colleagues and patients alike</li><li>Strong communication skills, especially the ability to translate complex ideas into simple language</li><li>Meaningful ties to our diverse communities and an eagerness to effect positive change within it</li><li>A \"hospitality mindset\" and track record of creating memorable experiences for others, embodying a true joy in serving others</li><li>Ability or willingness to learn motivational interviewing or health coaching.</li><li>1-2 years clinical experience as LPN, Paramedic or CMA</li><li>Experience with phlebotomy and injections (vaccines) </li><li>Reliable access to personal transportation</li><li>For the safety of our patients and staff, employees in this role must be fully vaccinated with all necessary vaccinations. This includes a booster for a completed COVID-19 vaccination.</li></ul><br><strong>COMPENSATION RANGE</strong> $22 - $25/hr based upon prior experience, performance, and market dynamics<br><br> #LI-TJ1<br><br>#LI-remote<br><br><strong>BENEFITS</strong><br><br><ul><li>Medical / Dental / Vision insurance</li><li>Flexible Spending Account</li><li>Health Savings Account + match</li><li>Company paid STD/LTD, AD&amp;D, and Life insurance</li><li>Paid Family Leave</li><li>401K + match</li><li>Paid Time Off</li></ul><br><strong>HOW WE HIRE</strong><br><br>Galileo is committed to hiring the best team possible to build health care that works for everyone. We value a diverse set of perspectives to deliver the best possible solutions to those problems. We look for talent from a wide range of backgrounds-including, but not limited to-race, age, sexual orientation, gender identity and expression, national origin, religion, disability, and veteran status. Galileo is an Equal Opportunity Employer and provides reasonable accommodations to applicants and employees with a qualifying disability or conflict with a sincerely held religious belief, unless doing so would cause an undue hardship or fail to eliminate a direct threat.</p>",
        "name": "Medical Assistant Temp Greenville, NC",
        "type": "external",
        "publication_date": "2023-10-28T10:04:28Z",
        "short_name": "medical-assistant-temp-greenville-nc",
        "model_type": "jobs",
        "id": 12948181,
        "locations": [
            {
                "name": "Flexible / Remote"
            },
            {
                "name": "Greenville, NC"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Mid Level",
                "short_name": "mid"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/galileohealth/medical-assistant-temp-greenville-nc"
        },
        "company": {
            "id": 15000122,
            "short_name": "galileohealth",
            "name": "Galileo Health"
        }
    },
    {
        "contents": "<p><b><b><b>Description</b></b></b><br><br>The Strategy Consultant provides data-based strategic analysis and direction to identify and address business issues and opportunities critical to company success. Provides business intelligence and strategic planning support for business segments or the company at large. The Strategy Consultant work assignments involve moderately complex to complex issues where the analysis of situations or data requires an in-depth evaluation of variable factors.<br><br><b><b>Responsibilities</b></b><br><br>The Strategy Consultant leads initiatives to analyze complex business problems and issues using data from internal and external sources. Brings expertise or identifies subject matter experts in support of multi-functional efforts to identify, interpret, and produce recommendations and plans based on company and external data analysis. Makes decisions on moderately complex to complex issues regarding technical approach for project components, and work is performed with limited direction. Exercises reasonable latitude in determining objectives and approaches to assignments.<br><br>This role will have a particular focus on Medicare enrollment growth strategy and investment optimization. The Strategy Consultant will support framework development that takes into account key dimensions of growth strategy such as marketing, sales and product investment trade-offs that are responsive to local competitive and provider dynamics. The Strategy Consultant will partner with key cross-functional leaders to develop scenarios and help drive alignment on an optimal data-driven investment strategy.<br><br><b>Required Qualifications</b><br><br><ul><li>Bachelor's Degree with a strong record of academic achievement</li><li>At least 2 years of full-time work experience in strategy consulting, investment banking, or corporate/business unit strategy</li><li>Strong problem-solving skills and demonstrated ability to perform complex quantitative and qualitative analyses</li><li>Strong record of leadership in a work setting and in extracurricular activities</li><li>Excellent verbal and written communication abilities</li><li>Highly collaborative, flexible, teamwork oriented working style</li><li>Strong commitment to personal and professional growth</li></ul><br><b>Preferred Qualifications</b><br><br><ul><li>Finance, accounting, engineering, business, economics, or technically focused undergraduate major</li><li>Managed care and/or healthcare services work experience</li></ul><br><b>Additional Information</b><br><br><ul><li>Flexibility with work location; options include:<br><br><ul><li>Remote, with majority of work conducted on Eastern Time</li><li>Humana's Washington, DC-area office in Rosslyn, Virginia</li><li>Humana's headquarters in Louisville, Kentucky</li></ul></li></ul><br><b>Work-At-Home Requirements</b><br><br><ul><li>Must have the ability to provide a high-speed DSL or cable modem for a home office. Associates or contractors who live and work from home in the state of California will be provided payment for their internet expense.</li><li>A minimum standard speed for optimal performance of 25x10 (25mpbs download x 10mpbs upload) is required.</li><li>Satellite and Wireless Internet service is NOT allowed for this role.</li><li>A dedicated space lacking ongoing interruptions to protect member PHI / HIPAA information</li></ul><br><b>#LI-Remote</b><br><br><b>#LI-WG1</b><br><br><b><b><b>Scheduled Weekly Hours</b></b></b><br><br>40</p>",
        "name": "Healthcare Strategy Consultant",
        "type": "external",
        "publication_date": "2023-11-02T13:07:44Z",
        "short_name": "healthcare-strategy-consultant-5ebfa0",
        "model_type": "jobs",
        "id": 12448990,
        "locations": [
            {
                "name": "Arlington, VA"
            },
            {
                "name": "Flexible / Remote"
            },
            {
                "name": "Louisville, KY"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Mid Level",
                "short_name": "mid"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/humana/healthcare-strategy-consultant-5ebfa0"
        },
        "company": {
            "id": 12023,
            "short_name": "humana",
            "name": "Humana"
        }
    },
    {
        "contents": "<p>At Alcon, we are driven by the meaningful work we do to help people see brilliantly. We innovate boldly, champion progress, and act with speed as the global leader in eye care. Here, you'll be recognized for your commitment and contributions and see your career like never before. Together, we go above and beyond to make an impact in the lives of our patients and customers.<br><br>We foster an inclusive culture and are looking for diverse, talented people to join Alcon. As a Cataract Surgical Consultant works collaboratively alongside a Division Manager within a singular division to strategically drive Alcon's advanced technologies with keen focus on LenSx, ORA, Argos, Revalia, and ATIOLs to new and existing accounts. With the introduction of Argos and our Digital Health Suite; Surgical Consultants are involved with building the Cataract Refractive Mangers proficiency and confidence when selling capital equipment and assisting in closing capital equipment leads in Cleveland or Columbus, OH area!<br><b><b>Primary Responsibilities:</b></b><ul><li>Lead targeting and forecasting efforts for LenSx, ORA, Argos, Revalia, ATIOLs and The Digital Health Suite sales within their assigned division and drive all appropriate divisional assets towards sales success in these areas.</li><li>Target and work towards converting large volume competitive accounts within the division partnering with all relevant divisional assets to do so.</li><li>Work with division members to make certain large volume accounts that have invested in our advanced technologies are thriving and growing in their use of our technologies.</li><li>Work as a liaison with the Clinical Application Specialist to both internal and external customers.</li><li>Be technically, financially, and strategically proficient in advanced technology equipment sales.</li><li>Be fully capable of working with commercial, technical, clinical apps, training and finance personnel to insure long term success of our advanced technologies.</li><li>Report to their respective Regional Director and will work collaboratively with their Division Manager partner.</li></ul><b><b>Key Requirements/Minimum Qualifications:</b></b><ul><li>Bachelor's Degree or Equivalent years of directly related experience (or high school +13 yrs; Assoc.+9 yrs; M.S.+2 yrs)</li><li>The ability to fluently read, write, understand and communicate in English</li><li>5 Years of Proven Experience</li></ul><b><b>How to Thrive at Alcon:</b></b><ul><li>Build positive working relationships to achieve positive goals and business objectives</li><li>Balance experiencing new environments and working autonomously in a remote sales environment</li></ul><b>Travel Requirements: 50% with some overnights</b><br><b>Relocation assistance: No</b><br><br>Alcon is an Equal Opportunity Employer and participates in E-Verify. Alcon takes pride in maintaining a diverse environment and our policies are not to discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, gender identity, marital or veteran status, disability, or any other legally protected status. Alcon is also committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please send an email to <b>alcon.recruitment@alcon.com</b> and let us know the nature of your request and your contact information.</p>",
        "name": "Surgical Consultant CAT",
        "type": "external",
        "publication_date": "2023-10-19T23:47:45Z",
        "short_name": "surgical-consultant-cat-1e536a",
        "model_type": "jobs",
        "id": 12808869,
        "locations": [
            {
                "name": "Flexible / Remote"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Senior Level",
                "short_name": "senior"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/alcon/surgical-consultant-cat-1e536a"
        },
        "company": {
            "id": 974,
            "short_name": "alcon",
            "name": "Alcon"
        }
    },
    {
        "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities. The Company offers a full range of medical, dental, and vision benefits. Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees. The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners. As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies. <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
        "name": "Pharmacy Technician",
        "type": "external",
        "publication_date": "2023-11-02T12:50:25Z",
        "short_name": "pharmacy-technician-636d62",
        "model_type": "jobs",
        "id": 12909862,
        "locations": [
            {
                "name": "United States"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Senior Level",
                "short_name": "senior"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-636d62"
        },
        "company": {
            "id": 12096,
            "short_name": "cvshealth",
            "name": "CVS Health"
        }
    },
    {
        "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities. The Company offers a full range of medical, dental, and vision benefits. Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees. The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners. As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies. <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
        "name": "Pharmacy Technician",
        "type": "external",
        "publication_date": "2023-11-02T12:21:29Z",
        "short_name": "pharmacy-technician-75f4b6",
        "model_type": "jobs",
        "id": 12910401,
        "locations": [
            {
                "name": "United States"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Senior Level",
                "short_name": "senior"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-75f4b6"
        },
        "company": {
            "id": 12096,
            "short_name": "cvshealth",
            "name": "CVS Health"
        }
    },
    {
        "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities. The Company offers a full range of medical, dental, and vision benefits. Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees. The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners. As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies. <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
        "name": "Pharmacy Technician PT",
        "type": "external",
        "publication_date": "2023-11-02T12:39:44Z",
        "short_name": "pharmacy-technician-pt-7860c8",
        "model_type": "jobs",
        "id": 12832925,
        "locations": [
            {
                "name": "United States"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Senior Level",
                "short_name": "senior"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-pt-7860c8"
        },
        "company": {
            "id": 12096,
            "short_name": "cvshealth",
            "name": "CVS Health"
        }
    },
    {
        "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary: Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions. As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li></li><li><b>Required Qualifications</b><br>Minimum Required Qualifications:</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (i.e. APhA)</li><li>Free of pending felony charges or convictions for criminal offenses involving controlled substances</li><li></li><li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$57.00 - $70.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
        "name": "Dist Suppt Pharmacist FT",
        "type": "external",
        "publication_date": "2023-11-02T12:31:48Z",
        "short_name": "dist-suppt-pharmacist-ft-ce8a86",
        "model_type": "jobs",
        "id": 12629177,
        "locations": [
            {
                "name": "United States"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Mid Level",
                "short_name": "mid"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/cvshealth/dist-suppt-pharmacist-ft-ce8a86"
        },
        "company": {
            "id": 12096,
            "short_name": "cvshealth",
            "name": "CVS Health"
        }
    },
    {
        "contents": "<p><b><b><b>Description</b></b></b><br><br>Humana Gold Plus Integrated is seeking Care Coordinators to assess and evaluate member's needs and requirements to achieve and/or maintain optimal wellness state by guiding members/families towards and facilitate interaction with resources appropriate for the care and wellbeing of members. <br><br><strong><em> $2000 SIGN-ON BONUS for new associates! $2000 payable following 90 days employment. </em></strong><br><br><b><b>Responsibilities</b></b><br><br>The LTSS Care Coordinator employs a variety of strategies, approaches and techniques to manage a member's health issues.  The Care Coordinator understands own work area professional concepts/standards, regulations, strategies, and operating standards, and makes decisions regarding own work approach/priorities and follows direction.  Work is managed and often guided by precedent and/or documented procedures/regulations/professional standards with some interpretation.<br><br>The Care Coordinator responsibilities are as follows:<br><br><ul><li>Ensures members are receiving services in the least restrictive setting to achieve and/or maintain optimal well-being by assessing their care needs.</li><li>Identifies and resolves barriers that hinder effective care.</li><li>Plan and implement interventions to meet care needs.</li><li>Coordinates services, monitors, and evaluates the case management plan against the member's personal goals.</li><li>Ensures the patient is progressing towards desired outcomes by continuously monitoring patient care through use of assessment, data, conversations with member, and active care planning.</li><li>Guides members/families towards resources appropriate for their care. Services are driven by facilitating interactions with other payer sources, providers, interdisciplinary teams, and others involved in the member's care as appropriate and required by our comprehensive contract.</li><li>Visit Medicaid members in their homes, Assisted Living Facilities, and/or Long-Term Care Facilities and other care settings - 75-90% local travel (see Additional Information section).</li></ul><br><b>Required Qualifications</b><br><br>The Care Coordinator must meet <b>one</b> (1) of the following requirements:<br><br><ul><li>Bachelor's degree in social sciences, social work, human services, or a related field.</li><li>In lieu of Bachelor's degree - one (1) year of experience in long term care, hospital and/or Medicare/Medicaid Program experience, plus a minimum of two (2) years of experience conducting comprehensive assessment of the elderly population.</li><li>Unrestricted Licensed Practical Nurse (LPN) in the state of Illinois with one (1) year experience in conducting comprehensive assessments and provision of formal service for the elderly.</li><li>Licensed Professional Counselor (LPC).</li><li>Licensed Social Worker (LSW).</li></ul><br>The Care Coordinator must meet <b>all</b> following requirements:<br><br><ul><li><b>Must reside in the State of Illinois.</b></li><li>1-year experiences in health care and/or case management.</li><li>1-year experience with Medicare &amp; Medicaid recipients and/or long-term care and/or Home and Community based services and/or working with managed care organizations.</li><li>Intermediate to advanced computer skills and experience with Microsoft Word, Excel, and Outlook.</li><li>Ability to use a variety of electronic information applications/software programs including electronic medical records.</li><li>Exceptional communication and interpersonal skills with the ability to build rapport with internal and external customers and stakeholders.</li><li>This role is considered patient facing and is a part of Humana's Tuberculosis (TB) screening program. If selected for this role, you will be required to be screened for TB.</li><li>This role is part of Humana's Driver safety program and therefore requires an individual to have a valid state driver's license and proof of personal vehicle liability insurance with at least 100,000/300,000/100,000 limits.</li></ul><br><b>Work at Home Requirements</b><br><br><ul><li>At minimum, a download speed of 25 Mbps and an upload speed of 10 Mbps is recommended; wireless, wired cable or DSL connection is suggested.</li><li>Satellite, cellular and microwave connection can be used only if approved by leadership.</li><li>Associates who live and work from Home in the state of California, Illinois, Montana, or South Dakota will be provided a bi-weekly payment for their internet expense.</li><li>Humana will provide Home or Hybrid Home/Office associates with telephone equipment appropriate to meet the business requirements for their position/job.</li><li>Work from a dedicated space lacking ongoing interruptions to protect member PHI / HIPAA information.</li></ul><br><b>Additional Information </b><br><br><ul><li><b>Workstyle/Travel:</b> This is a Field position that requires 75 - 90% travel in the field to visit members. </li><li><b>Work Schedule</b>: Monday - Friday; 8am - 5pm CST but open to flexible work schedule. Possibility of working additional hours based on business needs.</li><li><b>Benefits: </b>Benefits are effective on day 1. Full time Associates enjoy competitive pay and a comprehensive benefits package that includes; 401k, Medical, Dental, Vision and a variety of supplemental insurances, tuition assistance and much more.....</li></ul><br><b>Interview Format</b><br><br>As part of our hiring process, we will be using an exciting interviewing technology provided by Modern Hire, a third-party vendor.  This technology provides our team of recruiters and hiring managers an enhanced method for decision-making.<br><br>If you are selected to move forward from your application prescreen, you will receive correspondence inviting you to participate in a pre-recorded Voice Interview and/or an SMS Text Messaging interview.  If participating in a pre-recorded interview, you will respond to a set of interview questions via your phone. You should anticipate this interview to take approximately 10-15 minutes.<br><br>If participating in a SMS Text interview, you will be asked a series of questions to which you will be using your cell phone or computer to answer the questions provided.  Expect this type of interview to last anywhere from 5-10 minutes. Your recorded interview(s) via text and/or pre-recorded voice will be reviewed, and you will subsequently be informed if you will be moving forward to next round of interviews.<br><br>#LI-Remote<br><br><b><b><b>Scheduled Weekly Hours</b></b></b><br><br>40</p>",
        "name": "Care Coordinator (Illinois Medicaid)",
        "type": "external",
        "publication_date": "2023-10-20T04:00:21Z",
        "short_name": "care-coordinator-illinois-medicaid",
        "model_type": "jobs",
        "id": 11977390,
        "locations": [
            {
                "name": "Aurora, IL"
            },
            {
                "name": "Chicago, IL"
            },
            {
                "name": "DeKalb, IL"
            },
            {
                "name": "Elgin, IL"
            },
            {
                "name": "Flexible / Remote"
            },
            {
                "name": "Gurnee, IL"
            },
            {
                "name": "Lake Bluff, IL"
            },
            {
                "name": "Marion, IL"
            },
            {
                "name": "McHenry, IL"
            },
            {
                "name": "Minooka, IL"
            },
            {
                "name": "Mount Vernon, IL"
            },
            {
                "name": "Peoria, IL"
            },
            {
                "name": "St. Charles, IL"
            },
            {
                "name": "Sycamore, IL"
            },
            {
                "name": "Vernon Hills, IL"
            }
        ],
        "categories": [
            {
                "name": "Healthcare"
            }
        ],
        "levels": [
            {
                "name": "Mid Level",
                "short_name": "mid"
            }
        ],
        "tags": [],
        "refs": {
            "landing_page": "https://www.themuse.com/jobs/humana/care-coordinator-illinois-medicaid"
        },
        "company": {
            "id": 12023,
            "short_name": "humana",
            "name": "Humana"
        }
    }
]