{
    "jobs": [
        {
            "contents": "<p>Broadridge is hiring! We are looking for our next QA/BA SME to work remotely. This is a Technology based role that will enable you to partner with the business team, define the requirements, assuring the realization of business benefits and supporting the business process. Are you a self starter who is passionate about analyzing and enhancing technology solutions? If you're striving to work among a growing and dynamic team, we would love you to read below.</p>\n<p>In this role, your primary responsibility will be to work with a newly acquired client for the Broadridge Product suite of applications that support Cash Management. You will directly contribute to the creation and execution of QA test cases, coordinate with the client on UAT and SIT testing and ultimately the deployment of resulting new systems and enhanced functionality. To be successful in this role, you should possess exceptional drive and energy, with a market-driven solutions orientation, proven product/project management experience, highly effective verbal and written communications skills, and the organizational ability to achieve results.</p>\n<p><strong>Responsibilities include:</strong><br/>\n- You will be BA/SME working directly with a large client to successfully define, develop, and deploy new products and functionality and ultimately convert to the BR platform.<br/>\n- You will work amongst the QA teams to complete testing of various deliverables. This will include writing test cases, executing test cases, logging defects and working with Development to fix defects.<br/>\n- You will establish and maintain consistent communication with the client regarding progress of conversion<br/>\n- You will lead Workflow / Gap process and analysis as we go through the process.<br/>\n- You may need to assist with training the client once the product functionalities are developed<br/>\n- You will communicate internally with the tech leads and development teams on enhancements for your product<br/>\n- Support the client and other workstreams during integration testing and User Acceptance Testing<br/>\n- You will handle issues/escalations and are empowered to make informed decisions for your respective stream responsibilities, ensuring we stay on target and ‘green’ for the all deliverables leading to the end date of the conversion and beyond.</p>\n<p><strong>Qualifications</strong>:<br/>\n- Wealth Management experience in customer/retail cash management is a plus Cash management knowledge is specific to customer transactions and processes such as ACH, wires, checks, money markets.<br/>\n- Experience writing detailed user stories and requirements documentation<br/>\n- Experience eliciting complex requirements from a client verbally in meetings<br/>\n- Knowledge of Agile project methodology<br/>\n- Comfortable with completing QA-related responsibilities<br/>\n- Industry knowledge of processing these types of transactions with SWIFT, NACHA, Money Fund Companies a plus.<br/>\n- 5+ years' experience in Product Management or QA Testing and or product/brokerage operations<br/>\n- Self-starter; comfortable working under tight deadlines in a high-pressure environment<br/>\n- Highly detail oriented and organizational skills a must.<br/>\n- Must be able to work nights and weekends as required.<br/>\n- Must be assertive with client to prevent scope creep<br/>\n- Experience using JIRA<br/>\n- Experience executing a major technology project – including but not limited to enhancements to functions, building new functionality or applications, managing feature lists and ensuring project is delivered on time and in scope. Project management background/exposure is a plus.</p>\n<h1>LI-MR1</h1>",
            "name": "QA/BA SME (CONTRACT) REMOTE - JR1031150",
            "type": "external",
            "publication_date": "2021-07-14T14:19:14Z",
            "short_name": "qaba-sme-contract-remote-jr1031150",
            "model_type": "jobs",
            "id": 6290114,
            "locations": [
                {
                    "name": "Newark, NJ"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/qaba-sme-contract-remote-jr1031150"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p>Broadridge is hiring! We are looking for a Financial Analyst to support our Asset Management segment. This is an excellent opportunity to join a growing and dynamic team. Passionate about driving opportunities to demonstrate your outstanding finance potential? If so, please read below!</p>\n<p>This role is responsible for aspects directly related to Global Asset Management functions, including related Process, Policies, Procedures, Systems, Compliance, Controls and Reporting. Functional accounting responsibilities include Fixed Assets, Prepaid, Software, other Intangibles and Facilities/Lease accounting and Project Accounting. The successful candidate will be a collaborative, proactive, ambitious and analytical individual with general accounting knowledge.</p>\n<p><strong>Responsibilities and oversight include:</strong><br/>\n- Monthly/quarterly book close<br/>\n- Reporting &amp; Analysis<br/>\n- Account Reconciliations<br/>\n- Fixed asset accounting<br/>\n- Prepaid accounting<br/>\n- Intangible accounting<br/>\n- Facilities lease accounting<br/>\n- Project Accounting<br/>\n- Compliance SOX reporting<br/>\n- Free cash flow<br/>\n- Build relationships with various business partners and be an overall good representative of the department.<br/>\n- Pro-actively identify issues and offer solutions</p>\n<p><strong>Requirements:</strong><br/>\n- Bachelor’s degree in Accounting/Finance<br/>\n- 1-3 years of prior experience in an Accounting Role, ideally within an Audit function<br/>\n- A blended background of Accounting and FP&amp;A desired<br/>\n- Prior experience working for a Big 4 or next tiered firm is a strong plus<br/>\n- CPA or CPA in progress desired, not required<br/>\n- Excellent organization, oral and written communication skills<br/>\n- Ability to prioritize tasks, lead several priorities and work under pressure<br/>\n- Team oriented<br/>\n- Highly proficient in Microsoft Excel and PowerPoint<br/>\n- Oracle a plus</p>\n<p><strong>Why Join Broadridge?</strong><br/>\n    - We offer a valuable benefits package effective date of hire including comprehensive healthcare (medical/prescription drug, dental, and vision), wellness benefits, fertility treatment, inclusive parental leave, life insurance, tuition reimbursement, disability benefits and more.<br/>\n- We support a number of associate-led networks where associates with similar backgrounds and interests can find peer support, shape company policy and culture, receive mentorship from senior members, and develop their careers.<br/>\n- We provide a competitive 401k plan with employer match and additional basic company contribution.<br/>\n- We encourage our associates to rest and relax by taking advantage of our generous paid time off program including vacation, personal holidays, sick time, and paid company holidays.<br/>\n- We strive to improve both our environmental impact as well as our industries’ by partnering with our clients to decrease their carbon footprint through digitization, data, and innovation.<br/>\n- We empower our people and our communities. Through our volunteer time off and matching gift programs, we encourage associates to help make Broadridge an indispensable community partner. </p>\n<h1>LI-ME1</h1>",
            "name": "Financial Analyst -Asset Management - JR1031517",
            "type": "external",
            "publication_date": "2021-08-06T07:45:41Z",
            "short_name": "financial-analyst-asset-management-jr1031517",
            "model_type": "jobs",
            "id": 6494106,
            "locations": [
                {
                    "name": "Newark, NJ"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/financial-analyst-asset-management-jr1031517"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p><strong>Job Responsibilities: </strong><br/>\nUpdate time sensitive production instructions in IQ to ensure job processing in compliance with client requirements Enter job insertion and postage related information in database in a timely manner Complete work with accuracy above speed, but escalate if the SLA cannot be met and/or request assistance from teammates. Efficiently complete documented tasks which support internal and external client needs. Provide coverage to support our clients.Â Be prepared to act as the first point of contact for client inquiries. Support other Client Ops/Client Relations teams across multiple Broadridge sites. Build relationships with internal departments such as Print, Production, QC, Logistics and Finance. Act as a liaison between Production and the Client Relations teams. May perform other duties/responsibilities as needed or assigned.</p>\n<p><strong>Preferred Qualifications: </strong><br/>\n- 1+ year of experience in a client service related role, or equivalent experience.<br/>\n- A medium level of computer competency.<br/>\n- Intermediate skills using the MS Office suite.</p>\n<p><strong>Skills/Competencies: </strong><br/>\n- Detail oriented, ability to multi-task, and good time management and follow-up skills.<br/>\n- Able to maintain a positive relationship with clients and co-workers.<br/>\n- Able to work collaboratively and professionally with internal colleagues to build relationships.<br/>\n- Good oral and written communication skills to turnover ongoing issues to the next shift.<br/>\n- Ability to work with a sense of urgency to meet client SLAs.<br/>\n- Ability to identify and resolve basic problems and escalate as needed.<br/>\n- Ability to follow documented procedures.</p>\n<p><strong>Requirements:</strong><br/>\n- Basic experience with MS Access, Excel, Word and Outlook required.<br/>\n- Ability to work a flexible schedule.<br/>\n- 1+ years of experience working at a computer related position.<br/>\n- In a team environment we succeed as a team, so the expectation is to support the team's success.</p>",
            "name": "Associate Client Operations Rep - JR1030094",
            "type": "external",
            "publication_date": "2021-06-22T06:52:37Z",
            "short_name": "associate-client-operations-rep-jr1030094",
            "model_type": "jobs",
            "id": 6138142,
            "locations": [
                {
                    "name": "Coppell, TX"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Entry Level",
                    "short_name": "entry"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/associate-client-operations-rep-jr1030094"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p>Are you seeking a position within a growing company? Broadridge is hiring! Our mission is to attract, develop and retain extraordinary talent. Being a place where exceptionally driven and hardworking people want to work is how we deliver award-winning services to our customers and ultimately create customer value.</p>\n<p><strong>Responsibilities:</strong><br/>\n- Act as the front line; supporting members of the team and management to maintain and grow our client base<br/>\n- Update and monitor internal reports to ensure the timely and efficient progress of each client mailing and departmental projects<br/>\n- Act as a client advocate and interface between all departments<br/>\n- Monitor the effectiveness of systems, policies and procedures and makes appropriate recommendations to ensure daily operations are efficient<br/>\n- Use experience to support the developmental needs of fellow associates<br/>\n- Act as a role model to other associates in consistent implementation of standard methodologies with regards to client interactions and departmental procedures<br/>\n- Participate in ongoing projects, including drafting written requirements or procedures as requested<br/>\n- Research and respond, in a timely manner, to requests all client requests and inquiries<br/>\n- Partner internally, as well as with other departments, to continually add efficiency to the day to day processes as well as to increase client satisfaction<br/>\n- Participate in offseason training and projects</p>\n<p><strong>Qualifications:</strong><br/>\n- Possess 2+ years' experience in a senior client relations/project administrator role or equivalent<br/>\n- BA/BS degree preferred and/or equivalent work experience<br/>\n- Excellent written and verbal communication and interpersonal skills<br/>\n- Excellent negotiation and analytical skills<br/>\n- Ability to prioritize effectively, multitask, and manage time appropriately with keen attention to detail<br/>\n- Proficiency in Microsoft Office Suite<br/>\n- The ability to work in a highly collaborative and dynamic environment<br/>\n- Communicate effectively and efficiently across departments, with staff, senior management and clients<br/>\n- Provide extraordinary client service to our clients and associates<br/>\n- Maintain favorable client relationships in order to identify additional service needs<br/>\n- Ability to work well independently as well as part of a team</p>\n<p><strong>Locations:</strong> Brentwood, New York </p>",
            "name": "Client Relationship Administrator - JR1027485",
            "type": "external",
            "publication_date": "2021-06-22T07:24:33Z",
            "short_name": "client-relationship-administrator-jr1027485-2858b3",
            "model_type": "jobs",
            "id": 6138145,
            "locations": [
                {
                    "name": "Long Island, NY"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Entry Level",
                    "short_name": "entry"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/client-relationship-administrator-jr1027485-2858b3"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p>Are you seeking a position within a growing company? Broadridge is hiring! Our mission is to attract, develop and retain outstanding talent. Being a place where exceptionally driven and hardworking people want to work is how we deliver award-winning services to our customers and ultimately build customer value. We’re seeking a VP of Wealth Lending to join our Wealth Lending and Securities Based Lending business. Acquired by Broadridge in 2019, Rockall has had tremendous success in wealth lending technology over the last five years, bringing the first cloud based SBL platform to market and more recently improving this platform with a suite of advisor facing and direct-to-client capabilities in order to serve the full life cycle of SBL loans.</p>\n<p><strong>Responsibilities: </strong><br/>\n- You will be leading and developing our portfolio of wealth lending products<br/>\n- Ensure a high quality client on-boarding experience from post-sales to go-live across our North American and International client base<br/>\n- Have a detailed understanding of the evolving wealth lending market, in particular the demand-side channel opportunity and to be able to formulate and execute the growth strategy<br/>\n- Lead multi-disciplinary teams across product management and product implementation/ on-boarding throughout the full implementation life cycle<br/>\n- Lead the product management function for Broadridge’s evolving portfolio of wealth lending products; determine the product strategy, advised by the market and market opportunity, to drive product growth<br/>\n- Ensure that all aspects of client delivery from initial project planning through to implementation and go live are managed rigorously ensuring customer delivery is timely and within defined budget and scope; adapt to client agile vs. non-agile methodologies based on client maturity/ as determined by clients<br/>\n- Support pre-sales engagements with Wealth Lending prospects to accelerate sales opportunities. Build, establish and maintain external client relationships at senior levels in order to craft and drive the strategy for our Wealth Lending business<br/>\n- Build, establish and maintain an internal network in the wider Broadridge Wealth business, to improve collaboration, scaling and internal partnering opportunities<br/>\n- Build strong internal relationships with Engineering, Operations and Service Delivery teams to ensure the full end-to-end product delivery process is optimal</p>\n<p><strong>Qualifications: </strong><br/>\n- 10+ years of strategic and tactical product management experience, including bringing new products to market in the WM segment and setting vision and direction for the roadmap, ideally in the demand-side channel (BDs, IBDs, RIAs and other channel firms), including pricing strategy<br/>\n- Program Management experience at a senior level in a product delivery or consulting environment, delivering complex, large scale and concurrent projects, ideally within a Wealth Lending environment<br/>\n- Experienced in leading a high-performance team of senior managers and professional services consultants, and a thorough appreciation of how to empower high performing individuals.<br/>\n- Significant experience leading multiple internal teams across disparate locations<br/>\n- Ability to solve problems at a strategic, tactical and functional level<br/>\n- Ability to build and nurture internal networks, to be flexible and adapt to a dynamic work environment<br/>\n- Self-motivating, entrepreneurial spirit with the ability to be resourceful and take initiative<br/>\n- Exceptional stakeholder management<br/>\n- Excellent verbal and written communication skills<br/>\n- A background in data analytics and/or machine learning would also be helpful</p>\n<p><strong>Why join Broadridge? </strong><br/>\n- We offer a valuable benefits package effective date of hire including comprehensive healthcare (medical/prescription drug, dental, and vision), wellness benefits, fertility treatment, inclusive parental leave, life insurance, tuition reimbursement, disability benefits and more.<br/>\n- We support a number of associate-led networks where associates with similar backgrounds and interests can find peer support, shape company policy and culture, receive mentorship from senior members, and develop their careers.<br/>\n- We provide a competitive 401k plan with employer match and additional basic company contribution.<br/>\n- We encourage our associates to rest and relax by taking advantage of our generous paid time off program including vacation, personal holidays, sick time, and paid company holidays.<br/>\n- We strive to improve both our environmental impact as well as our industries’ by partnering with our clients to decrease their carbon footprint through digitization, data, and innovation.</p>\n<h1>LI-PP1</h1>",
            "name": "VP Wealth Lending - JR1031446",
            "type": "external",
            "publication_date": "2021-08-07T07:59:20Z",
            "short_name": "vp-wealth-lending-jr1031446",
            "model_type": "jobs",
            "id": 6502891,
            "locations": [
                {
                    "name": "New York, NY"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/vp-wealth-lending-jr1031446"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p>Broadridge is growing! We are seeking a Client Management Associate to join our team inNewark, New Jersey! We are looking for someone to lead the implementation of new BPO clients, manage existing client relationships and assist with developing new offerings to grow our firm's revenue. We need a highly-skilled individual to manage client relationships, both prospective and existing, and collaborate on defining and executing new revenue streams for our business.</p>\n<p>Are you looking to join a creative and dynamic t eam? If so, we would love to meet you.</p>\n<p>Responsibilities</p>\n<p>Manage existing client relationships, including leading Monthly Governance Committees, contractual obligations and client issue resolution<br/>\nLiaising Finance, Billing, Legal and other service teams to ensure client obligations are met<br/>\nAssist with client-led audits that require BPO participation<br/>\nLead strategic client projects<br/>\nManage the creation, execution and delivery of client metrics and perform data trend analysis to provide clients with deep insights into their critical metrics<br/>\nProvide BPO Ops teams with client analytics support<br/>\nFind opportunities for process automation / digital transformation for BPO &amp; clients<br/>\nUtilize data tools and business intelligence tools to drive effective decision-making<br/>\nWork on pipeline opportunities to help grow BPO revenue<br/>\nQualificatio ns</p>\n<p>Driven, motivated and intellectually curious<br/>\nAttention to detail and impeccable time management skills - ability to manage multiple projects simultaneously<br/>\nExcellent Written &amp; Verbal communication skills<br/>\nAbility to work with and present to Senior Executives within Broadridge and at our clients<br/>\nAbility to work under tight deadlines<br/>\nProficient in MSFT Office, including PowerBI<br/>\nLEAN / Six Sigma a plus</p>",
            "name": "Client Management Associate",
            "type": "external",
            "publication_date": "2021-08-28T09:02:31Z",
            "short_name": "client-management-associate-00f726",
            "model_type": "jobs",
            "id": 6700782,
            "locations": [
                {
                    "name": "Newark, NJ"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Entry Level",
                    "short_name": "entry"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/client-management-associate-00f726"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p>Are you seeking a position within a growing company? Broadridge is hiring! Our mission is to attract, develop and retain outstanding talent. Being a place where exceptionally driven and hardworking people want to work is how we deliver award-winning services to our customers and ultimately build customer value. We’re seeking a SRE Operations, Application Support Specialist to join our Site Reliability Engineering team! You will have the opportunity to support Broadridge’s cutting edge products, collaborate with different business units and craft a service model.</p>\n<p><strong>Responsibilities:</strong><br/>\n<em> Build and implement a customer service support that is aligned with our strategic priorities across GPTM<br/>\n</em> Partner with development, product, application support and operational teams to ensure seamless execution of service<br/>\n<em> Design and implement a service model that focuses on operational excellence across the team<br/>\n</em> Collaborate with Account Management, Sales and business unit leadership in developing long-term and short-term customer service goals<br/>\n<em> Lead initiatives to scale the customer service organization to meet the growing needs of the business<br/>\n</em> Craft, measure and exceed service standards and key performance metrics<br/>\n<em> Continually assess department structure and craft opportunities for growth and succession planning for the team<br/>\n</em> Anticipate future business changes and actively adapt plans to ensure premium service<br/>\n<em> Lead quality of service metrics to ensure a premium-quality customer experience<br/>\n</em> Drive associate development<br/>\n* Identify product roadmap opportunities through client interactions and build feedback loop for Product Management</p>\n<p><strong>Qualifications:</strong><br/>\n<em> 10 years of experience of Application Support or supporting production platforms<br/>\n</em> Knowledge or experience of DevOps / SRE is advantageous<br/>\n<em> Strong technical skills. Experience in the following is preferred:<br/>\n</em> PCF, Eclipse, Maven, GIT, Java (1.6+), Java JEE (EJB 3.1), Web Services, RESTful Services, JMS (with MQ) and real-time systems, XML/JAXB, JPA/Hibernate and JDBC, Springboot, Kafka -- flex with some<br/>\n<em> Agile methodology / Scrum / Kanban----<br/>\n</em> Test Driven Development methodology/JUnit4/Mockito. A plus<br/>\n<em> Experience leading global customer service teams<br/>\n</em> Ability to build a consolidated client service model<br/>\n<em> Establish and articulate a strategic vision, set goals, develop and track/measure results<br/>\n</em> Build and empower a strong team to achieve and exceed customer expectations<br/>\n<em> Experience working with Sales, Account Management and Product teams<br/>\n</em> Financial industry experience including some technical infrastructure knowledge-—plus<br/>\n<em> Project-implementation experience<br/>\n</em> Ability to travel in order to meet client obligations</p>\n<p><strong>Why join Broadridge?</strong><br/>\n<em> We offer a valuable benefits package effective date of hire including comprehensive healthcare (medical/prescription drug, dental, and vision), wellness benefits, fertility treatment, inclusive parental leave, life insurance, tuition reimbursement, disability benefits and more.<br/>\n</em> We support a number of associate-led networks where associates with similar backgrounds and interests can find peer support, shape company policy and culture, receive mentorship from senior members, and develop their careers.<br/>\n<em> We provide a competitive 401k plan with employer match and additional basic company contribution.<br/>\n</em> We encourage our associates to rest and relax by taking advantage of our generous paid time off program including vacation, personal holidays, sick time, and paid company holidays.<br/>\n* We strive to improve both our environmental impact as well as our industries’ by partnering with our clients to decrease their carbon footprint through digitization, data, and innovation.</p>",
            "name": "Application Support - SRE Operations - JR1027386",
            "type": "external",
            "publication_date": "2021-07-16T06:29:19Z",
            "short_name": "application-support-sre-operations-jr1027386",
            "model_type": "jobs",
            "id": 6316850,
            "locations": [
                {
                    "name": "Newark, NJ"
                }
            ],
            "categories": [
                {
                    "name": "Account Management/Customer Success"
                },
                {
                    "name": "Accounting"
                },
                {
                    "name": "Data Science"
                },
                {
                    "name": "Editor"
                },
                {
                    "name": "Education"
                },
                {
                    "name": "HR"
                },
                {
                    "name": "Marketing"
                },
                {
                    "name": "Product"
                },
                {
                    "name": "Project Management"
                },
                {
                    "name": "Retail"
                },
                {
                    "name": "Sales"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/application-support-sre-operations-jr1027386"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p>Broadridge Financial Solutions, Inc. (BR), a $4 billion global Fintech leader and part of the S&amp;P 500® Index, is a leading provider of investor communications and technology-driven solutions to banks, broker-dealers, asset and wealth managers and corporate issuers. At Broadridge, we do well by doing good. Our unique culture is guided by the Service-Profit Chain—the idea that success is mutual, directly connecting employee engagement, client satisfaction, and the creation of stockholder value. We enable better financial lives by powering investing, governance, and communications for our clients, their customers, and the financial services industry.</p>\n<p>Are you seeking a position within a growing company? Our mission is to attract, develop and retain extraordinary talent. Being a place where exceptionally driven and hardworking people want to work is how we deliver award-winning services to our customers and ultimately create customer value. Are you looking for a growing and dynamic firm where you can make an immediate impact? If so, we encourage you to read below because Broadridge is hiring!</p>\n<p><strong>Job Description</strong></p>\n<p><strong>Focused Responsibilities Include:</strong><br/>\n- Perform analysis of foreign exchange and interest rate exposure; provide recommendations for, and lead execution of, risk management programs<br/>\n- Perform analysis on capital structure and strategic capital spend scenarios<br/>\n- Create and present PowerPoint presentations related to capital structure and planning analytics<br/>\n- Co-lead all strategic and ad hoc Treasury analytic/modeling projects<br/>\n- Co-lead efforts on establishing and maintaining international cash flow reporting<br/>\n- Co-lead efforts on international expansion including due diligence and integration for acquisitions outside of the US<br/>\n- Collaboratively work with Corporate Accounting, Tax, FP&amp;A teams, and business units</p>\n<p><strong>General Responsibilities Include:</strong><br/>\n- Perform daily Corporate funding and execute global payments transactions<br/>\n- Help to manage administration of various bank web portals and user entitlements<br/>\n- Create interest expense forecasts based on capital spend scenarios<br/>\n- Aid in the cash/liquidity forecasting process<br/>\n- Produce recurring, quarterly reporting on rating agency financial metrics, cash balances, and share repurchase statistics for the Treasurer and CFO<br/>\n- Execute quarterly share repurchase programs, with daily reporting to the Treasurer and CFO<br/>\n- Perform analysis on acquisition financing strategies<br/>\n- Maintain and enhance knowledge of current and evolving regulations, practices and technologies in Treasury<br/>\n- Develop, implement and manage treasury process improvements, metrics and reporting<br/>\n- Participate in producing management reporting for the quarterly earning cycles<br/>\n- Manage data sourcing and review of quarterly financial reporting</p>\n<p><strong>Qualifications:</strong><br/>\n- 3-7 years of relevant Treasury, Finance, Accounting, or similar experience<br/>\n- Bachelor’s Degree in Accounting, Finance or Economics (MBA a plus)<br/>\n- Detail oriented, with excellent presentation, communication, and organization skills<br/>\n- Proven proficiency in financial analysis, modeling, and forecasting<br/>\n- Strong knowledge of financial statements<br/>\n- Basic knowledge of general accounting</p>\n<p><strong>Location:</strong><br/>\n- Lake Success, New York and remote hybrid<br/>\n- Light travel may be required</p>\n<h1>LI-LR</h1>\n<p><strong>Why join Broadridge? </strong><br/>\n- We offer a valuable benefits package effective date of hire including comprehensive healthcare (medical/prescription drug, dental, and vision), wellness benefits, fertility treatment, inclusive parental leave, life insurance, tuition reimbursement, disability benefits and more.<br/>\n- We support a number of associate-led networks where associates with similar backgrounds and interests can find peer support, shape company policy and culture, receive mentorship from senior members, and develop their careers.<br/>\n- We provide a competitive 401k plan with employer match and additional basic company contribution.<br/>\n- We encourage our associates to rest and relax by taking advantage of our generous paid time off program including vacation, personal holidays, sick time, and paid company holidays.<br/>\n- We strive to improve both our environmental impact as well as our industries’ by partnering with our clients to decrease their carbon footprint through digitization, data, and innovation.</p>\n<p>Broadridge is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, age or any other protected status. \"Everyone Benefits from Diversity &amp; Inclusion. Diverse &amp; Inclusive Teams Drive Growth.\" US applicants: Click here to view the \"EEO is the Law\" poster. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation in the event you are unable or limited in your ability to use or access the Company’s career webpage as a result of your disability. You may request a reasonable accommodation(s) by calling 888-237-7769 or by sending an email to </p>\n<p><strong>Location:</strong> North Hempstead, New York </p>",
            "name": "Treasury Manager - JR1030216",
            "type": "external",
            "publication_date": "2021-07-21T11:02:59Z",
            "short_name": "treasury-manager-jr1030216",
            "model_type": "jobs",
            "id": 6346446,
            "locations": [
                {
                    "name": "Lake Success, NY"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/treasury-manager-jr1030216"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p>Are you seeking a position within a growing company? Broadridge is hiring! Our mission is to attract, develop and retain extraordinary talent. Being a place where exceptionally driven and hardworking people want to work is how we deliver award-winning services to our customers and ultimately create customer value.</p>\n<p>The Sr. Cross Media Designer is primarily responsible for logic-driven (versus traditional, conceptual graphic) design and support of print and digital client marketing communications. Proficient in variable data design, campaign development, and delivery. Mentors junior level team members and acts as a subject matter authority in variable data print development.<br/>\nThis person is proficient in Adobe Creative Suite, HTML5, Java Script, and Variable Data Document Design and Software (XMPie, Pageflex, Adobe Experience Manager).</p>\n<p><strong>Job Responsibilities:</strong><br/>\n<em> Work with team members to understand project requirements and to develop the overall design and execution of institutional and retail financial services products<br/>\n</em> Collaborate with Project Management, Content Analysis, IT, and peers on cross media solutions for client campaigns<br/>\n<em> Responsible for understanding business requirements and making appropriate recommendations for executing within our product applications<br/>\n</em> Exhibit critical thinking and analytical problem solving both in troubleshooting production issues as well as in proactively researching, testing, and implementing new product functionality within the campaign tools<br/>\n<em> Mentor team members in all areas of variable data print design<br/>\n</em> Responsible for engineering/re-engineering and implementing Creative Team processes<br/>\n<em> Responsible for Creative Team onboard training and representation of Creative in interdepartmental onboard training and campaign tool demonstrations<br/>\n</em> Provide production support for peers and internal partners as needed</p>\n<p><strong>Preferred Qualifications:</strong> Bachelor’s degree in a related field (Graphic Design, Industrial Design, or Publication Design) with 5-7 years' experience. Variable Data Design required, and Digital Design experience preferred.</p>\n<p><strong>Skills/Competencies: </strong>The Sr. Cross Media Designer is proficient in Adobe Creative Suite, HTML5, Java Script, and Variable Data Document Design and Software (XMPie, Pageflex, Adobe Experience Manager), Pitstop, Distiller, Microsoft Office, and prepress processes. The Sr. Cross Media Designer has expertise in digital print processes, equipment, and substrates, direct mail/postal requirements and fulfillment processes as well as a working knowledge of the SDLC and development practices. Must possess good time management and excellent written and verbal communication skills.</p>\n<p><strong>Why join Broadridge?</strong><br/>\n<em> We offer a valuable benefits package effective date of hire including comprehensive healthcare (medical/prescription drug, dental, and vision), wellness benefits, fertility treatment, inclusive parental leave, life insurance, tuition reimbursement, disability benefits and more.<br/>\n</em> We support a number of associate-led networks where associates with similar backgrounds and interests can find peer support, shape company policy and culture, receive mentorship from senior members, and develop their careers.<br/>\n<em> We provide a competitive 401k plan with employer match and additional basic company contribution.<br/>\n</em> We encourage our associates to rest and relax by taking advantage of our generous paid time off program including vacation, personal holidays, sick time, and paid company holidays.<br/>\n* We strive to improve both our environmental impact as well as our industries’ by partnering with our clients to decrease their carbon footprint through digitization, data, and innovation.</p>",
            "name": "Senior Cross Media Designer - JR1030857",
            "type": "external",
            "publication_date": "2021-07-20T04:18:01Z",
            "short_name": "senior-cross-media-designer-jr1030857-1a55d3",
            "model_type": "jobs",
            "id": 6339324,
            "locations": [
                {
                    "name": "Owings Mills, MD"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/senior-cross-media-designer-jr1030857-1a55d3"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p><strong>Company Description</strong><br/>\nBroadridge Financial Solutions, Inc. (BR), a $4 billion global Fintech leader and a part of the S&amp;P 500® Index, is a leading provider of investor communications and technology-driven solutions to banks, broker-dealers, asset and wealth managers and corporate issuers.</p>\n<p>Everything we do at Broadridge centers on our purpose. By powering the critical infrastructure behind investing, governance, and communications, Broadridge makes our clients stronger, and through them, we enable better financial lives for tens of millions of people. For more information about Broadridge, please visit Broadridge.com</p>\n<p><strong>Job Description</strong><br/>\nIn today's highly competitive financial environment, the financial services industry is faced with significant challenges in the regulatory and legal landscape. To assist our clients with overcoming these challenges, Broadridge offers a comprehensive class action asset recovery solution that helps clients navigate the complexities currently found in the global class action arena.</p>\n<p>Broadridge is currently seeking a Research Administrator to join it Global Class Action team. In this position you will work closely with our head of research to assist in the maintenance of its proprietary class action database by facilitating in the identification, analysis, and entry of new asset recovery opportunities, while monitor existing opportunities for key motions and developments. In addition, you will be tasked with ad hoc research projects to support Broadridge’s growing Global Class Action team. You should strive to develop a deep understanding of both securities class action litigation in the US and abroad, including the settlement administration process.</p>\n<p>This is an excellent opportunity within our growing Global Class Action team. Are you a self-starter who demonstrates strong initiative? Are you highly organized? If so, we encourage you to read below to learn how you can make an immediate impact within our fast-growing organization.</p>\n<p><strong>Responsibilities</strong><br/>\n- Assist with the maintenance of Broadridge’s proprietary class action database<br/>\n- Research and monitor court dockets, including summarizing and analyzing specific filings<br/>\n- Participate and lead custom projects<br/>\n- Monitor the effectiveness of systems, policies and procedures and make appropriate recommendations to ensure daily operations are efficient<br/>\n- Work with development teams to enhance and test internal applications<br/>\n- Have a logical approach to gathering data and analyzing it to solve internal and client inquiries<br/>\n- Actively participate in acclimating to the role, learning from peers and ensuring accurate understanding of the role and tasks</p>\n<p><strong>Qualifications</strong><br/>\n- JD preferred<br/>\n- Experience researching litigation including familiarity with court dockets, US civil procedure, and an understanding of various motions together with an ability to quickly discern and digest relevant information<br/>\n- Self-starter with excellent interpersonal skills<br/>\n- Demonstrated project management skills including defining of scope, resources and timelines, and managing deliverables<br/>\n- Strong verbal and written communication skills<br/>\n- Familiarity with common office software applications (Microsoft Office suite)<br/>\n- Significant legal and topical research experience<br/>\n- Attention to detail in a fast-paced work environment<br/>\n- Global securities class action and/or financial tech industry experience a plus</p>\n<p><strong>Additional Information</strong><br/>\nDue to COVID-19, the majority of our associates are working remotely. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video.</p>\n<p>Broadridge is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, age or any other protected status. \"Everyone Benefits from Diversity &amp; Inclusion. Diverse &amp; Inclusive Teams Drive Growth.\" US applicants: Click here to view the \"EEO is the Law\" poster.</p>\n<p><strong>Locations</strong>: Brentwood, New York</p>",
            "name": "Global Class Action Research Administrator - JR1029450",
            "type": "external",
            "publication_date": "2021-06-18T08:17:56Z",
            "short_name": "global-class-action-research-administrator-jr1029450-ba57c6",
            "model_type": "jobs",
            "id": 6111680,
            "locations": [
                {
                    "name": "Long Island, NY"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Entry Level",
                    "short_name": "entry"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/global-class-action-research-administrator-jr1029450-ba57c6"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p><strong>Company Description</strong><br/>\nBroadridge Financial Solutions, Inc. (BR), a $4 billion global Fintech leader and part of the S&amp;P 500® Index, is a leading provider of investor communications and technology-driven solutions to banks, broker-dealers, asset and wealth managers and corporate issuers. At Broadridge, we do well by doing good. Our unique culture is guided by the Service-Profit Chain—the idea that success is mutual, directly connecting employee engagement, client satisfaction, and the creation of stockholder value. We enable better financial lives by powering investing, governance, and communications for our clients, their customers, and the financial services industry.</p>\n<p><strong>Job Description</strong><br/>\n**Broadridge is growing! We are currently hiring a Senior Software Engineer -Java to join our team in Newark NJ</p>\n<p>Are you looking for a multifaceted and creative environment where you can lead projects? This is an excellent opportunity to drive the future of this emerging and dynamic IT development organization. If that sounds like the type of setting you'd like to work in, we'd love to hear from you.</p>\n<p><strong>Responsibilities</strong>:<br/>\n- Analyze, craft and implement new features/functionality primarily using the following technologies: Java/JEE, Javascript, MQ/Kafka, HTML, JQuery, CSS, XML, JSON, Ajax, SQL (DB2), Python<br/>\n- Work on multiple projects and manage time effectively<br/>\n- Participate in requirement gathering process, propose solution, and create design documents<br/>\n- Provide timely and accurate communication of status to team, project and technical leads<br/>\n- Gather requirements, design, code, test and implement according to design specifications<br/>\n- Collaborate with project lead on identification of problems and suggest solutions for the resolution of coding issues<br/>\n- Seek out new technologies and ideas to add value to our products<br/>\n- Re-engineer current systems to allow for flexibility, stability, and scalability while preserving existing functionality</p>\n<p><strong>Qualifications</strong>:<br/>\n- Bachelor's degree in Computer Science or related field, or equivalent professional experience<br/>\n- 5+ years of experience working in related technologies T<br/>\n- 5+ years of experience with object-oriented design and in-depth working knowledge of Java/JEE<br/>\n- Strong data analysis, design and testing skills<br/>\n- Strong communication skills, both written and oral<br/>\n- Understanding and some experience in Agile development<br/>\n- Ability to solve complex problems independently and gather experienced advice as needed<br/>\n- Ability to work under the supervision of the team lead and as part of multiple teams on overlapping projects<br/>\n- Ability to focus on delivering results in a dynamic environment with tight deadlines and multiple priorities<br/>\n- Web service development experience is a plus</p>",
            "name": "Senior software engineer - Java - JR1027025",
            "type": "external",
            "publication_date": "2021-06-22T06:08:08Z",
            "short_name": "senior-software-engineer-java-jr1027025-64683c",
            "model_type": "jobs",
            "id": 6136810,
            "locations": [
                {
                    "name": "Newark, NJ"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/senior-software-engineer-java-jr1027025-64683c"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p>Broadridge is hiring! We are currently looking to hire our next Accounting Analyst. This is a Full Time / Direct Hire role based out of our Newark, NJ location.</p>\n<p>The External Financial Reporting Group is seeking an experienced, energetic, strategic and analytical individual to join the team responsible for running the performance of the Company's external financial reporting function. You will complement a team who runs quarterly and annual SEC reporting, interacts with external auditors, assists in the preparation and review of quarterly earnings release materials, performs accounting research, involved with M&amp;A deal teams, and various other duties and special projects for the corporate external reporting department. This role reports directly to the Vice President of External Financial Reporting.</p>\n<p>Are you passionate about joining our growing team? If so, please read below!</p>\n<p><strong>Provide leadership to ensure the timely and accurate completion of the following functions:</strong><br/>\n- Quarterly 10-Q filings<br/>\n- Annual 10-K filing<br/>\n- Quarterly Earnings Release - financial data<br/>\n- Accounting research responsibilities and benchmarking related to external reporting matters<br/>\n- Run Ad Hoc reporting requests and support M&amp;A activity<br/>\n- Sarbanes-Oxley testing and attestations<br/>\n- Directs the compilation and review of certain financial data that is disclosed in the Company's 10-Q and 10-K filings with the SEC as w ell as the Earnings Releases quarterly<br/>\n- Provide support for Company business development representatives in potential Company M&amp;A business acquisitions, including working with valuation specialists to derive intangible asset values associated with acquisitions, as well as the annual goodwill impairment analyses.<br/>\n- Building and maintaining relationships with various business partners, including the legal, treasury, business development and FP&amp;A departments to achieve the highest level of client satisfaction.<br/>\n- Respond to ad hoc requests for information and analysis.<br/>\n- Ensure quarterly close activities are performed accurately and to required timelines.</p>\n<p><strong>Requirements:</strong><br/>\n- Bachelors Degree in Accounting/Finance or similar subject area<br/>\n- 1-3 years required in Public Accounting; Big 4 audit experience preferred.<br/>\n- CPA required or in process of finalizing<br/>\n- Experience with publicly traded companies external filings.<br/>\n- Experience working with external auditors on audit issues.<br/>\n- Experience researching and understanding SEC rules and GAAP accounting rules a plus.</p>\n<p><strong>Skills:</strong><br/>\n- Demonstrated skills in running projects.<br/>\n- Drive projects to successful completion.<br/>\n- Ability to multi-task and meet designated deadlines.<br/>\n- Work with limited direct supervision.<br/>\n- Attention to detail is critical<br/>\n- Solid communication skills are a must (written and verbal)<br/>\n- Ability to research and understand complex accounting issues<br/>\n- Identify and implement creative solutions that support increased efficiency and strengthen internal controls over financial reporting #LI-ME1</p>",
            "name": "Accounting Analyst- External Reporting (CPA) - JR1022014",
            "type": "external",
            "publication_date": "2021-07-01T14:12:54Z",
            "short_name": "accounting-analyst-external-reporting-cpa-jr1022014",
            "model_type": "jobs",
            "id": 6205304,
            "locations": [
                {
                    "name": "Newark, NJ"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Entry Level",
                    "short_name": "entry"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/accounting-analyst-external-reporting-cpa-jr1022014"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p>Are you looking for a position with a growing company? Broadridge is hiring! We’re seeking a Site Reliability Engineer to join our team and work within our Technology Organization. As a member of a small cross functional team, you will own a particular infrastructure challenge! Design and document systems, including writing and reviewing code, to automate away problems. Undertake measured, methodical, troubleshooting of complicated systems under pressure. Partake in an on-call rotation alongside the engineers who build our production backend.</p>\n<p><strong>Job Responsibilities:</strong><br/>\n- Technology Management; Participate in defining microservices infrastructure from inception and design, through deployment, operation and continuous refinement. Support services before they go live through activities such as system design, deployment automation, capacity planning and launch reviews.<br/>\n- Service Management; Align with and directly service internal business units and external clients. Ability to directly interact with business unit executives and project management to communicate operational status, key project status, and business value of services produced. Supervise record of success in a matrix organization.<br/>\n- SLA Management; Ensure SLA and operational efficiency are achieved for products managed by third-party data center provider and internal support teams using resources and leadership within these organizations assigned to support these products. Pro-actively address issues to avoid any problems reoccurring without crafting undue layers of process or complexity.<br/>\n- Risk Management; Maintain a strong IT control environment, responsive to the risks across all aspects of technology.<br/>\n- Strategy; Work with the cross-functional teams to ensure the needs of infrastructure are prioritized and aligned with both enterprise and business plans. Build and maintain alignment with the business technology architecture and overall strategic goals and objectives.<br/>\n- Disaster Recovery and BCP; Contribute as required to the design and execution of the enterprise-wide recovery and business continuity plan. Plan and execute DR test events to meet internal and external obligations</p>\n<p><strong>Qualifications</strong><br/>\n- Minimum 5-7 years experience in a role supporting cloud based solutions or as an SRE<br/>\n- Bachelor's degree in Computer Science or equivalent practical experience<br/>\n- Experience in one or more of the following: Python, Go, Perl, or shell scripting<br/>\n- Experience with Unix/Linux operating systems internals and administration<br/>\n- Experience with GitLab and Jenkins<br/>\n- Data analysis techniques that can include:<br/>\n- Reliability modeling and prediction<br/>\n- Fault Tree Analysis<br/>\n- Root-cause and Root-Cause Failure Analysis<br/>\n- Failure Reporting, Analysis and Corrective Action Systems<br/>\n- Extensive experience with Clouds, Kubernetes and Docker<br/>\n- Strong interpersonal skills that enable the individual to appropriately connect with technical and non-technical teams</p>",
            "name": "Specialist Service Delivery Engineer (Contract) (JR1029050)",
            "type": "external",
            "publication_date": "2021-07-07T10:33:34Z",
            "short_name": "specialist-service-delivery-engineer-contract-jr1029050-c4d763",
            "model_type": "jobs",
            "id": 6240195,
            "locations": [
                {
                    "name": "Newark, NJ"
                }
            ],
            "categories": [
                {
                    "name": "Account Management/Customer Success"
                },
                {
                    "name": "Accounting"
                },
                {
                    "name": "Data Science"
                },
                {
                    "name": "Design"
                },
                {
                    "name": "Editor"
                },
                {
                    "name": "HR"
                },
                {
                    "name": "Marketing"
                },
                {
                    "name": "Mental Health"
                },
                {
                    "name": "Product"
                },
                {
                    "name": "Project Management"
                },
                {
                    "name": "Retail"
                },
                {
                    "name": "Sales"
                },
                {
                    "name": "Software Engineer"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/specialist-service-delivery-engineer-contract-jr1029050-c4d763"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p>We’re seeking a Hands-On Java Web Services Developer to join our team remotely!</p>\n<p>If you're passionate about technology and are looking to be a part of a growing and dynamic Fin Tech company in New York, we encourage you to read below!</p>\n<p>Are you looking for a role you'll succeed in? We are needing an ambitious, detail oriented, and creative employee, with proven experience working with streaming data and concurrency. Do you want to showcase your developer skills and technical expertise? We will enable you to deliver high-quality end-to-end software solutions quickly and optimally in Java (primarily) within the Financial Industry.</p>\n<p><strong>Responsibilities</strong>:<br/>\n- Analyzing existing core services framework and re-implementing the future state as part of the new framework.<br/>\n- Developing, testing, debugging and implementing code for existing business applications and/or computer systems.<br/>\n- Experience with object oriented concepts and exposure to Java programming language.<br/>\n- Demonstrated knowledge of web-based programming environments and frameworks<br/>\n- Demonstrated knowledge or experience in software implementation lifecycle<br/>\n- Self-starter, motivated, with strong preference to work in team environment</p>\n<p><strong>Qualifications</strong><br/>\n- BS in Computer Science, or equivalent education and experience.<br/>\n- Development experience in programming and applications system environment, which includes the following: Core Skills: Java J2EE, Angular, Spring, Servlet, JSP, EJB, JTA, JMS and experience in Web technologies such as XML, Struts, Javascript, AJAX, Web Services is a strong plus.<br/>\n- Software development experience using microservice based applications like Spring-Boot.<br/>\n- Functional exposure to: Agile, Wealth/Financial Domain, Web Components, Component Based and Test Driven Development.</p>\n<p><strong>Locations</strong>: Brentwood, New York </p>",
            "name": "Java developer (Contract) (JR1030893)",
            "type": "external",
            "publication_date": "2021-07-07T10:57:13Z",
            "short_name": "java-developer-contract-jr1030893",
            "model_type": "jobs",
            "id": 6240202,
            "locations": [
                {
                    "name": "Long Island, NY"
                }
            ],
            "categories": [
                {
                    "name": "Account Management/Customer Success"
                },
                {
                    "name": "Accounting"
                },
                {
                    "name": "Data Science"
                },
                {
                    "name": "Design"
                },
                {
                    "name": "Editor"
                },
                {
                    "name": "Education"
                },
                {
                    "name": "HR"
                },
                {
                    "name": "Marketing"
                },
                {
                    "name": "Mental Health"
                },
                {
                    "name": "Product"
                },
                {
                    "name": "Project Management"
                },
                {
                    "name": "Retail"
                },
                {
                    "name": "Sales"
                },
                {
                    "name": "Software Engineer"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/java-developer-contract-jr1030893"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p><strong>Responsibilities:</strong><br/>\n<em> Define and build a CI/CD framework demonstrating open source and commercial products to allow for agility in the development of trading systems<br/>\n</em> Implement infrastructure automation using Terraform and Chef to provision, configure and deploy cloud-based systems in AWS.<br/>\n<em> Ensure the Revport cloud deployed systems follow Broadridge Information Security and Enterprise Cloud Architecture standard methodologies.<br/>\n</em> Assist with system architecture design to ensure our systems are reliable, highly available and secure.<br/>\n<em> May perform other duties/responsibilities as needed or assigned.<br/>\n</em> Desire and ability to investigate vaguely defined problems and generate solutions.</p>\n<p><strong>Qualifications:</strong><br/>\n<em> Bachelor’s degree in a technical field (Computer Science, engineering, etc.) or equivalent experience preferred<br/>\n</em> 3+ years’ experience as a Lead DevOps Automation Engineer<br/>\n<em> Experience with Git, Terraform, Chef, GitLab CI, Jenkins, and AWS highly desired<br/>\n</em> Knowledge of security standard methodologies for systems deployed in a cloud environment<br/>\n<em> Knowledge of one or more scripting languages (e.g. Shell, Groovy)<br/>\n</em> Very good communication skills, both verbal and written<br/>\n* Experience working remote full time is a nice to have</p>\n<h1>LI-MV1</h1>",
            "name": "Lead DevOps Software Engineer (JR1023723)",
            "type": "external",
            "publication_date": "2021-07-16T04:20:38Z",
            "short_name": "lead-devops-software-engineer-jr1023723-cba201",
            "model_type": "jobs",
            "id": 6316849,
            "locations": [
                {
                    "name": "Boston, MA"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/lead-devops-software-engineer-jr1023723-cba201"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p>Broadridge is hiring! We currently have an opening for Lead Quality Assurance Analyst with automation experience to join Boston, MA team. This opportunity is ideal for individuals seeking high growth potential and the chance to play an instrumental role in building quality software in an emerging market. If you're passionate about a position that plays a key role in the delivery of quality client solutions, we want to review your background!</p>\n<p><strong>Responsibilities:</strong><br/>\n- Improve &amp; Report the quality of software product functionality and deployment<br/>\n- Quickly ramp up and contribute to .NET &amp; Angular automated testing<br/>\n- Accept responsibilities of the regression test suite, and planning testing for new features<br/>\n- Work closely with the development &amp; QA teams to improve the existing tools &amp; process<br/>\n- Target the end goal of having as few touch points as possible between code commit and gated production deployment</p>\n<p><strong>Qualifications:</strong><br/>\n- 7+ years of QA experience<br/>\n- Minimum 2 years of experience as leading or coordinating QA Analysts<br/>\n- Understanding of multiple asset classes (fixed income, equities, derivatives)<br/>\n- Minimum 2 years of working knowledge with Private Equity<br/>\n- Proficient with automating web application testing (e.g., ASP.NET, Angular, React)<br/>\n- Nice to have hands on experience on C# and Playwright<br/>\n- Ability to engage development and business teams clarify requirements<br/>\n- Experience using Jira for work item management<br/>\n- Ability to learn and adapt quickly<br/>\n- Take pride in outdo the minimum required<br/>\n- Excellent problem-solving skills</p>",
            "name": "Lead Quality Assurance Analyst - JR1026912",
            "type": "external",
            "publication_date": "2021-06-21T07:39:45Z",
            "short_name": "lead-quality-assurance-analyst-jr1026912-20246c",
            "model_type": "jobs",
            "id": 6133647,
            "locations": [
                {
                    "name": "Boston, MA"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/lead-quality-assurance-analyst-jr1026912-20246c"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p>Broadridge is growing! We are currently hiring a Director, Software Engineering. In this role, you’ll work with and lead multiple agile teams. You’ll help modernize legacy codebases, and implement new features that embrace modern scalable, secure, resilient standard methodologies.</p>\n<p><strong>Responsibilities:</strong><br/>\n- Develop, test, debug and implement code for existing or new business applications.<br/>\n- Handle, and grow multiple teams of product focused software &amp; data engineers.<br/>\n- Review business and functional requirements provided by the Product Management team.<br/>\n- Create technical design documentation and contribute to technical design discussions that will result in new business or technical improvements.<br/>\n- Contribute to technical roadmap and continually review existing architecture for improvements.<br/>\n- Provide mentorship to other developers in terms of technology decisions and code reviews.<br/>\n- Work in an Agile software development process, contributing to story and task creation.<br/>\n- Ensure every coding path is unit tested and bug free.<br/>\n- Ensure all code conforms to software security practices and is free of security vulnerabilities.<br/>\n- Work with QA to build test cases and explain impacted test areas<br/>\n- Rapidly address issues and fix defects discovered during client implementations when needed<br/>\n- Collaborates and partner with business to plan and execute development projects, ensures that teams have appropriate products and technical specifications, direction, and resources to deliver projects on a daring, but achievable timeline.<br/>\n- Provides leadership and guidance to mentor, motivate, and lead team members and organizations to their optimum performance.</p>\n<p><strong>Qualifications:</strong><br/>\n- BS/MS degree in Computer Science, related degree, or comparable experience<br/>\n- 10+ years of overall software development experience, leading software, or data engineering teams<br/>\n- experience with Data Lake Infrastructure, Data Warehousing, and Data Analytics tools<br/>\n- Knowledge of IT strategic planning and capability development with experience implementing technology strategy and roadmaps<br/>\n- Shown experience designing, and supporting enterprise scale systems that have high performance and scalability requirements<br/>\n- Passion for always learning and applying new technologies to solve clients’ objectives<br/>\n- Prior experience leading a software organization through transformation<br/>\n- Demonstrated management experience in leading engineering teams; ability to coach and mentor resources and optimally handle and shape team and individual behaviors<br/>\n- Ability to attract, develop and retain talent<br/>\n- Ability to coach, motivate, and lead team members and organizations to their optimum performance<br/>\n- Expert presentation skills used to influence other leaders across the enterprise<br/>\n- Total dedication to quality and attention to detail</p>\n<h1>LI-MV1</h1>",
            "name": "Sr. Director- Software Engineering (JR1026368)",
            "type": "external",
            "publication_date": "2021-07-15T07:05:46Z",
            "short_name": "sr-director-software-engineering-jr1026368",
            "model_type": "jobs",
            "id": 6308422,
            "locations": [
                {
                    "name": "Boston, MA"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/sr-director-software-engineering-jr1026368"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<ul>\n<li>Are you seeking a position within a growing company? Broadridge is hiring! Our mission is to attract, develop and retain extraordinary talent. Being a place where exceptionally driven and hardworking people want to work is how we deliver award-winning services to our customers and ultimately create customer value.</li>\n<li>You will communicate effectively, prioritize tasks at hand and raise issues as appropriate in a timely manner.</li>\n<li>You'll develop an effective working relationship with each team member as well as internal departments, value and use diverse perspectives.</li>\n<li>You will have a strong focus on starting with the end in mind,\" breaking work down into process steps, plan, anticipate challenges and identify solutions.</li>\n<li>You'll support and contribute to Broadridge's client centric culture taking responsibility for client satisfaction and retention.</li>\n<li>You will assist in training new associates on the day to day functions and provide guidance with client inquiries.</li>\n<li>You'll demonstrate the ability to manage multiple concurrent tasks with proficiency.</li>\n<li>You will participate on assigned projects and special tasks as assigned by management within a set timeframe.</li>\n</ul>\n<p><strong>Preferred qualifications:</strong><br/>\n<em> Experience in a client relations role or equivalent experience.<br/>\n</em> Industry knowledge of Proxy and Corporate Actions is a plus.<br/>\n<em> Strong organizational, verbal and written communication skills and analytical skills.<br/>\n</em> Very detail oriented, ability to multi-task, prioritize and follow through on tasks to meet deadlines.<br/>\n<em> Capability to thrive in a dynamic working environment with a keen attention to detail.<br/>\n</em> A self-starter who is highly adaptable, team oriented and results driven.<br/>\n<em> Excellent written and verbal communication and presentation skills.<br/>\n</em> Superior proficiency in Excel is strongly preferred<br/>\n<em> Proficiency in Microsoft Office Suite (Access, PowerPoint, Word etc.).<br/>\n</em> Ability to act in an ethical, professional manner with a client centric focus, and value being part of a diverse team.</p>\n<p><strong>Locations:</strong> Brentwood, New York</p>",
            "name": "Associate Client Relations Administrator-JR1025161",
            "type": "external",
            "publication_date": "2021-06-18T09:53:29Z",
            "short_name": "associate-client-relations-administratorjr1025161",
            "model_type": "jobs",
            "id": 6111688,
            "locations": [
                {
                    "name": "Long Island, NY"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Entry Level",
                    "short_name": "entry"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/associate-client-relations-administratorjr1025161"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p>Broadridge is growing! We are seeking a Senior Director- IT Audit to join our Finance team! You will lead and participate on IT audit engagements from planning to reporting and produce quality deliverables to both departmental and professional standards while ensuring audits are completed timely and within budget.</p>\n<ul>\n<li>Plan, execute, and document audit reports, including risk assessments, audit planning, audit testing, control evaluation, report drafting and follow-up, and verification of issue closure while ensuring audits are completed timely and within budget.</li>\n<li>Finalize audit findings and use judgment to provide an overall opinion on the control environment through developing recommendations to strengthen internal controls.</li>\n<li>Assist in all aspects of audit plan including risk assessments, audit planning and resource scheduling</li>\n<li>Effectively manage and lead the Audit team, performing timely review of work performed and providing honest and constructive feedback to proactively manage performance and enhance skills across the team. Understand the team's strengths and areas of development and guide the team in accomplishing their individual goals whilst giving them opportunities to improve their skills.</li>\n<li>Partner with stakeholders, business management, other control groups (e.g. risk management and compliance) and regulators establishing strong working relationships while maintaining independence.</li>\n<li>Stay current with industry trends to find opportunities for game changing innovations or strategic partnerships.</li>\n<li>Examine, evaluate, and identify key risk areas within internal policies and procedures relating to IT processes and verify compliance with relevant regulations.</li>\n<li>Build and maintain knowledge of current technologies including artificial intelligence, blockchain, cloud computing, and digital.</li>\n<li>Demonstrates strong subject matter knowledge in critical areas of technology infrastructure, information security, and technology service processes.</li>\n<li>Apply current knowledge of IT trends, techniques, and risks to identify security and risk management improvement opportunities.</li>\n<li>Demonstrate knowledge and experience of legal and regulatory technology risks and requirements across business sectors and regions.</li>\n<li>Participate in multiple departmental initiatives and working groups to enhance or provide efficiencies in audit coverage on existing areas as well as emerging technologies</li>\n<li>Implement and execute an effective program of continuous monitoring for assigned areas, including monitoring of key metrics to identify control issues and adverse trends</li>\n<li>Conduct regular meetings with partners providing updates in a clear concise manner to management and other senior business leaders.</li>\n<li>Oversee and report on key special projects to Corporate Audit Management.</li>\n<li>Lead, mentor, and train junior members of the Corporate Audit Team.</li>\n<li>Travel to business locations as required</li>\n</ul>\n<p><strong>Required Qualifications</strong><br/>\n- A BS/BA degree or higher in information systems<br/>\n- 6+ years of experience in one of the following: audit, technology risk management, information security, IT program management, technology governance, or availability management</p>\n<p><strong>Desired Qualifications</strong><br/>\n- Ability to execute in a dynamic, high demand, environment while ensuring multiple priorities are met<br/>\n- Ability to work effectively in a team environment and across all organizational levels, where flexibility, collaboration, and adaptability are important<br/>\n- Excellent verbal and written communication skills<br/>\n- Good analytical skills with high attention to detail and accuracy<br/>\n- Solid problem solving skills<br/>\n- Strong organizational, multi-tasking, and prioritizing skills<br/>\n- Certified Information Systems Security Professional (CISSP)<br/>\n- Strong understanding of the controls and technical requirements/considerations, including supporting tools, for these platforms<br/>\n- Risk or compliance experience<br/>\n- Solid knowledge and understanding of audit methodologies and tools that support audit processes<br/>\n- Certification in one or more: CISSP, CIA or CISA designation<br/>\n- Leadership experience for professional auditors, risk management, or project leadership professionals</p>\n<p><strong>Why Join Broadridge?</strong><br/>\n- We offer a valuable benefits package effective date of hire including comprehensive healthcare (medical/prescription drug, dental, and vision), wellness benefits, fertility treatment, inclusive parental leave, life insurance, tuition reimbursement, disability benefits and more.<br/>\n- We support a number of associate-led networks where associates with similar backgrounds and interests can find peer support, shape company policy and culture, receive mentorship from senior members, and develop their careers.<br/>\n- We provide a competitive 401k plan with employer match and additional basic company contribution.<br/>\n- We encourage our associates to rest and relax by taking advantage of our generous paid time off program including vacation, personal holidays, sick time, and paid company holidays.<br/>\n- We strive to improve both our environmental impact as well as our industries’ by partnering with our clients to decrease their carbon footprint through digitization, data, and innovation.<br/>\n- We empower our people and our communities. Through our volunteer time off and matching gift programs, we encourage associates to help make Broadridge an indispensable community partner.</p>\n<h1>LI-ME1</h1>",
            "name": "Sr. Dir. IT Audit - JR1029469",
            "type": "external",
            "publication_date": "2021-07-01T14:18:57Z",
            "short_name": "sr-dir-it-audit-jr1029469",
            "model_type": "jobs",
            "id": 6205306,
            "locations": [
                {
                    "name": "Newark, NJ"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/sr-dir-it-audit-jr1029469"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p><strong>Job Description</strong><br/>\nXBRL, or eXtensible Business Reporting Language, is an XML standard for tagging business and financial reports to increase the visibility and accessibility of business information by using a uniform format. The US GAAP Financial Reporting Taxonomy and the International Financial Reporting Standards (IFRS) Taxonomy are lists of computer-readable tags in XBRL that allow companies to label the thousands of pieces of financial data that are included in financial statements and related footnote disclosures. The tags allow computers to automatically search for and assemble data so those data can be readily accessed and analyzed by investors, analysts, journalists, and the SEC staff.</p>\n<p>The XBRL Consultant prepares XBRL exhibits for financial statements, footnote disclosures and financial statement schedules included in Forms 10-Q, 10-K, 20-F and 40-F that are submitted to the SEC. These XBRL files are created using the SEC-approved US GAAP or IFRS Taxonomies for clients from multiple industries, including Oil and Gas, Real Estate, Retail, Mining, Financial Institutions, and others. The XBRL Consultant handles the workflow, communications and timelines for assigned clients on multiple, concurrent projects.</p>\n<p>The XBRL Consultant must apply professional accounting skills to select the appropriate tags from the US GAAP and IFRS Taxonomies for each value included in the financial statements, footnote disclosures and financial statement schedules. The XBRL Consultant must use independent judgement and work with clients to figure out reported financial facts map directly to standard taxonomy elements or which ones may require the creation of customized extension elements to complete the XBRL instance document. The XBRL Consultant must review XBRL documents for accuracy, consistency and completeness of data tagging. The XBRL Consultant must also maintain an understanding of current compliance standards promulgated by XBRL US and the Securities and Exchange Commission (SEC) to interpret and understand the continuously evolving XBRL compliance requirements in order to address client questions related to their specific compliance requirements.</p>\n<ul>\n<li>The XBRL Consultant must display excellent written and oral communication skills to communicate well with external customers and demonstrate well-developed organization and interpersonal skills.</li>\n<li>Meeting customer-initiated deadlines requires the ability to handle multiple tasks and exciting priorities. The XBRL Consultant must demonstrate high proficiency with Microsoft Office products, including Excel, Word and PowerPoint as well as workflow and collaboration software products.</li>\n<li>The XBRL Consultant must also demonstrate a strong proficiency with the Company’s internally-developed PROfile software.<br/>\nThe XBRL Consultant maintains a CPA license and completes the required Continuing Professional Education (CPE) requirements of a minimum 40 hours per year to maintain his/her license.<br/>\nWhy join Broadridge?</li>\n<li>We offer a valuable benefits package effective date of hire including comprehensive healthcare (medical/prescription drug, dental, and vision), wellness benefits, fertility treatment, expansive parental leave, life insurance, tuition reimbursement, disability benefits and more.</li>\n<li>We support a number of associate-led networks where associates with similar backgrounds and interests can find peer support, shape company policy and culture, receive mentorship from senior members, and develop their careers.</li>\n<li>We provide a competitive 401k plan with employer match and additional basic company contribution.</li>\n<li>We encourage our associates to rest and relax by taking advantage of our generous paid time off program including vacation, personal holidays, sick time, and paid company holidays.</li>\n<li>We strive to improve both our environmental impact as well as our industries’ by partnering with our clients to decrease their carbon footprint through digitization, data, and innovation.</li>\n</ul>",
            "name": "Consultant, XBRL Consulting Services - JR1029488",
            "type": "external",
            "publication_date": "2021-06-19T07:25:57Z",
            "short_name": "consultant-xbrl-consulting-services-jr1029488-7441b4",
            "model_type": "jobs",
            "id": 6123500,
            "locations": [
                {
                    "name": "Houston, TX"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Entry Level",
                    "short_name": "entry"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/consultant-xbrl-consulting-services-jr1029488-7441b4"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        }
    ]
}